{
	"version": "https://jsonfeed.org/version/1.1",
	"title": "Unfathoming",
	"language": "en",
	"home_page_url": "https://unfathom.ing/",
	"feed_url": "https://unfathom.ing/feed/feed.json",
	"description": "A blog about the life experiences, thoughts, and ideas of a computer scientist with a strange life.",
	"author": {
		"name": "Du Cheng",
		"url": "https://unfathom.ing/archive/2024/about-me"
	},
	"items": [
		{
			"id": "https://unfathom.ing/archive/2024/chinese-keyboards/",
			"url": "https://unfathom.ing/archive/2024/chinese-keyboards/",
			"title": "The Chinese keyboard problem",
			"content_html": "<p>In the digital age, the keyboards on our phones serve as the primary interface between our thoughts and the online world. For Chinese speakers, this interface comes with a hidden cost. Every known proprietary Chinese input method monitors user behavior, and without reasonably useful open source offerings, users are forced to self-censor to avoid detection.</p>\n<p>For those who don't know what makes a Chinese keyboard different from a regular QWERTY keyboard (they use the same layout), most Chinese keyboard software includes a PinYin input method editor that attempts to figure out the best glyph for the latin letters typed.</p>\n<p></p><details class=\"dropdown\">\n<summary>How Pinyin input method editors work</summary>\n<div class=\"dropdown-content\">\n<ol><p></p>\n  <li><strong>Input parsing:</strong> The system breaks down the Pinyin input into syllables.</li>\n  <li><strong>Character matching:</strong> For each syllable, the system identifies all possible matching Chinese characters.</li>\n  <li><strong>Contextual analysis:</strong> The interpreter examines the surrounding context, including previously entered characters and partial phrases.</li>\n  <li><strong>Frequency analysis:</strong> Common words and phrases are given higher priority based on usage statistics.</li>\n  <li><strong>User history:</strong> The system considers the user's past choices and typing patterns.</li>\n  <li><strong>Predictive modeling:</strong> Machine learning algorithms predict the most likely character or word combinations based on all available data.</li>\n  <li><strong>Ranking and display:</strong> The system presents a ranked list of potential character combinations, with the most likely options appearing first.</li>\n  <li><strong>Dynamic updating:</strong> As the user continues typing or selects characters, the predictions are continuously refined.</li>\n</ol>\n\t\t\t</div>\n\t\t  </details>\n<p>Chinese is a uniquely complex language. There are currently 8105 汉字 (hanzi) which I'll refer to as glyphs for simplicity sake. The ability to turn something like &quot;nihao&quot; into &quot;你好&quot; is surprisingly difficult to implement correctly and effiecently. This has led to a problem where only sufficiently resourced organizations have taken on the task of developing and implementing such algorithms.</p>\n<p>The fundamental technology required to communicate effectively on Android devices is gate kept by three large organizations, namely, Alibaba, Tencent, and Huawei. Like every large technology company in the world, these three hand over all data about a user at the request of the government.</p>\n<h2 id=\"one-sided-surveillance\" tabindex=\"-1\">One-sided surveillance <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/chinese-keyboards/\">#</a></h2>\n<p><a href=\"https://citizenlab.ca/2023/08/vulnerabilities-in-sogou-keyboard-encryption/\">Every word</a> that is typed or spoken into the keyboards developed by the three companies listed above is transmitted back to those companies for processing<a class=\"sidenote-anchor\" href=\"https://unfathom.ing/archive/2024/chinese-keyboards/\">1</a><span class=\"sidenote\" aria-describedby=\"sn1\"><a class=\"sidenote-number\" id=\"sn1\" href=\"https://unfathom.ing/archive/2024/chinese-keyboards/\">1</a>This is not unique to Chinese apps. Gboard and SwiftKey also do the same thing.</span> by opaque neural networks that look for patterns of potential banned phrases. If that wasn't bad enough, these keyboard apps have also been used to sidestep end-to-end encryption in apps like Signal and Element, allowing authorities to view conversations from one perspective and make life-changing decisions without having the whole story.</p>\n",
			"date_published": "2024-07-03T00:00:00Z"
		}
		,
		{
			"id": "https://unfathom.ing/archive/2024/embracing-monero/",
			"url": "https://unfathom.ing/archive/2024/embracing-monero/",
			"title": "Embracing Monero as banks betray our privacy",
			"content_html": "<p>Many people have asked me why I use Monero and care so much about privacy, so here's my answer.</p>\n<p>Most traditional banks are not just storing your money; they're harvesting some of the most sensitive data about you. Every transaction you make paints a picture of your life - your habits, your preferences, your politics, and more than you could ever imagine. Banks coordinate with insurance companies and advertising agencies to analyze our transaction data in search of ways to charge us more or manipulate our buying behavior.</p>\n<p>The Fourth Amendment protects Americans from unreasonable searches by the government, yet most people roll over and give up when private entities essentially conduct invasive searches of their financial lives. They treat it as part of the cost of doing business in modern America, or they believe it is necessary for fraud prevention.</p>\n<p>While proponents argue that financial surveillance <em>can</em> help prevent fraud, this benefit is vastly outweighed by what I call the &quot;assumed consent&quot; model, where agreements from decades ago are used to assume consent into new privacy-invading initiatives<a class=\"sidenote-anchor\" href=\"https://unfathom.ing/archive/2024/embracing-monero/\">1</a><span class=\"sidenote\" aria-describedby=\"sn1\"><a class=\"sidenote-number\" id=\"sn1\" href=\"https://unfathom.ing/archive/2024/embracing-monero/\">1</a>You were okay with this one thing, you'll surely be okay with this other thing, so lets bury it on page 43 in a font so small you need a microscope to read it!</span>. The current banking system actively works to squeeze every bit of value from your personal data, sharing it with insurance companies, tech giants, and advertisers.</p>\n<p>Monero offers an alternative to this invasive and exploitative assumed consent model. Its privacy-focused design ensures that financial transactions aren't shared with the highest bidders. It's not about having something to hide<a class=\"sidenote-anchor\" href=\"https://unfathom.ing/archive/2024/embracing-monero/\">2</a><span class=\"sidenote\" aria-describedby=\"sn2\"><a class=\"sidenote-number\" id=\"sn2\" href=\"https://unfathom.ing/archive/2024/embracing-monero/\">2</a>The goal isn't to hide for fraudulant purposes, it's to maintain control over who can view what, while keeping advertisers, data brokers, and insurance companies out.</span>; it's about maintaining the basic right to privacy in an increasingly invasive digital world. It's a way to voice disapproval of the surveillance capitalism model which most banks and financial institutions are engaged in.</p>\n<h2 id=\"the-tangibility-of-surveillance-capitalism\" tabindex=\"-1\">The tangibility of surveillance capitalism <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/embracing-monero/\">#</a></h2>\n<p>Consider this scenario: you spot an interesting product advertisement online and decide to make a purchase<a class=\"sidenote-anchor\" href=\"https://unfathom.ing/archive/2024/embracing-monero/\">3</a><span class=\"sidenote\" aria-describedby=\"sn3\"><a class=\"sidenote-number\" id=\"sn3\" href=\"https://unfathom.ing/archive/2024/embracing-monero/\">3</a>Apparently this is more common than I thought. I've always blocked ads, so I've never had this experience.</span>. A day later, you become inundated with ads for similar items. This targeted approach isn't just about meeting your needs, it's a calculated effort to shape your consumer behavior, potentially leading you to make additional, unnecessary purchases.</p>\n<p></p><details class=\"dropdown\">\n<summary>Personal experience</summary>\n<div class=\"dropdown-content\">\n<p>As another example that has directly impacted me, I often find myself in situations where I need to use mobile hotspot, typically while traveling. On top of unlimited data, Verizon tries to charge a $10 monthly subscription for mobile data. As a user of GrapheneOS, I have the ability to block the response to the ping that looks for hotspot usage, forcing the phone to report that the hotspot wasn't used, which prevents the additional charge on top of unlimited data.</p><p>While my situation isn't directly related to banking, it opened my eyes to the tangibility of surveillance capitalism and how it gets average people to spend extra on things that should be included in the cost of the basic service.</p>\n</div>\n</details><p></p>\n<h2 id=\"what-makes-monero-great\" tabindex=\"-1\">What makes Monero great? <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/embracing-monero/\">#</a></h2>\n<p>Monero correctly implements<a class=\"sidenote-anchor\" href=\"https://unfathom.ing/archive/2024/embracing-monero/\">4</a><span class=\"sidenote\" aria-describedby=\"sn4\"><a class=\"sidenote-number\" id=\"sn4\" href=\"https://unfathom.ing/archive/2024/embracing-monero/\">4</a>Zcash does not correctly implement these in its current form.</span> three key technologies: Perfect Forward Secrecy (PFS), Perfect Concurrent Secrecy (PCS), and ring signatures<a class=\"sidenote-anchor\" href=\"https://unfathom.ing/archive/2024/embracing-monero/\">5</a><span class=\"sidenote\" aria-describedby=\"sn5\"><a class=\"sidenote-number\" id=\"sn5\" href=\"https://unfathom.ing/archive/2024/embracing-monero/\">5</a>PFS and PCS are technologies that make encrypted messaging apps like Signal secure against man in the middle attacks.</span>. PFS ensures that even if a private key is compromised in the future, past transactions remain secure. PCS takes this a step further by protecting current and future transactions as well. Ring signatures allow a user to sign a transaction on behalf of a group, effectively hiding the true sender among a set of possible participants.</p>\n<p>This creates a layer of plausible deniability, making it nearly impossible to trace transactions back to their origin. Unlike <a href=\"https://unfathom.ing/archive/2024/the-bitcoiners-were-wrong\">surveillance coins</a>, Monero obscures transaction amounts, sender and receiver addresses, and the transaction history, providing users with a level of financial privacy that closely mirrors cash transactions in the physical world.</p>\n<h2 id=\"challenges-and-considerations\" tabindex=\"-1\">Challenges and considerations <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/embracing-monero/\">#</a></h2>\n<p>Most governments aren't too pleased with the privacy that Monero offers, and as a result of that, it's become increasingly difficult to obtain the coin<a class=\"sidenote-anchor\" href=\"https://unfathom.ing/archive/2024/embracing-monero/\">6</a><span class=\"sidenote\" aria-describedby=\"sn6\"><a class=\"sidenote-number\" id=\"sn6\" href=\"https://unfathom.ing/archive/2024/embracing-monero/\">6</a>Ever since the shutdown of LocalMonero, I've switched to peer-to-peer trades despite the risks.</span>, as it's been delisted from all major exchanges. This difficulty in obtaining and trading has led to a situation where there's much demand and little supply.</p>\n<p>Another thing to consider is that you may attract <a href=\"https://www.justice.gov/opa/pr/man-convicted-violent-home-invasion-robberies-steal-cryptocurrency\">unwated attention</a> from a variety of adversaries despite using the coins lawfully. Consider storing Monero (or any other crypto) equivelent to storing the same value in cash, and protect yourself the way you would if it were cash. I recommend getting a hardware wallet.</p>\n",
			"date_published": "2024-07-02T00:00:00Z"
		}
		,
		{
			"id": "https://unfathom.ing/archive/2024/operating-in-hostile-computing-environments/",
			"url": "https://unfathom.ing/archive/2024/operating-in-hostile-computing-environments/",
			"title": "Operating in hostile computing environments",
			"content_html": "<div class=\"callout quote\">Given a restrictive computing environment, it is reasonable to assume that a bored end user will seek or create some semblance of freedom within.</div>\n<p>Ever since graduating high school, I've thought a lot about what's possible within restrictive computing environments, and I've been the type to go as far as to discover new vulnerabilities in well known software so I can play video games on devices that I shouldn't be able to.</p>\n<p>Let's assume the adversary is particularly litigious, making privilege escalation a risky maneuver. Let's also assume the device has access to most of the internet, besides a few NSFW sites What can be done within the boundaries? Quite a lot actually.</p>\n<h2 id=\"webviews\" tabindex=\"-1\">WebViews <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/operating-in-hostile-computing-environments/\">#</a></h2>\n<p>The first thing that probably comes to mind is web browsers, or more specifically WebViews. Everything from a printer to a Nintendo Switch has one, and the web is a very versatile tool.</p>\n<p>This is usually my favorite course of action; get into a webview and from there I can connect to the web GUI of my Proxmox VE instance hosted at home to access a full Linux-based OS that is actually mine.</p>\n",
			"date_published": "2024-06-28T00:00:00Z"
		}
		,
		{
			"id": "https://unfathom.ing/archive/2024/the-new-site-design/",
			"url": "https://unfathom.ing/archive/2024/the-new-site-design/",
			"title": "The new site design",
			"content_html": "<p>Welcome to the new Unfathoming. I've gone through three notable iterations of the site now, first on <a href=\"https://unfathom.ing/archive/2024/the-new-site-design/\">quartz</a> by Jacky Zhao, second entirely static, with me manually writing HTML for every single page (and dealing with the consequences of trying to keep 50+ pages looking consistent), and thirdly (hopefully finally) what you're looking at right now.</p>\n<h2 id=\"user-interface-and-user-experience\" tabindex=\"-1\">User interface &amp; user experience <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/the-new-site-design/\">#</a></h2>\n<p>I want my site design to be timeless, consistent, accessible, and work well on all types of content, from super serious topics like privacy to relaxed topics like how I found my cat. It doesn't need to be boring, but it does need to be a stable design.</p>\n<p>My usual style has all the rounded corners, drop shadows, and fancy stuff you see on most modern sites, but within 10 years my usual design style will feel stale and outdated, which is fine because the products can evolve, but I want my personal website to stay the same, so it requires a design that will look good in 50 years.</p>\n<h2 id=\"architecture\" tabindex=\"-1\">Architecture <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/the-new-site-design/\">#</a></h2>\n<p>The new site is written with the <a href=\"https://11ty.dev\">Eleventy</a> static site generator because it's super simple with few dependencies and it is something I could learn in a <a href=\"https://unfathom.ing/archive/2024/a-rainy-saturday-morning\">morning before sunrise</a>.</p>\n<p><picture><source type=\"image/avif\" srcset=\"https://unfathom.ing/img/NLOiXGUdVO-1019.avif 1019w\"><source type=\"image/webp\" srcset=\"https://unfathom.ing/img/NLOiXGUdVO-1019.webp 1019w\"><img alt=\"diagram showing the workflow from source code to website\" loading=\"lazy\" decoding=\"async\" src=\"https://unfathom.ing/img/NLOiXGUdVO-1019.png\" width=\"1019\" height=\"344\"></picture></p>\n<p>While most people use WordPress, I hate how long simple actions take. Even just loading a page can take a long time, and I didn't want to deal with the security nightmare of WordPress either. I've operated WP sites in the past, and every single one of them was compromised in some form or another, despite having what I thought was above average security. I guess that's just part of the PHP plague.</p>\n<p>Something interesting about the site is that if I want to show the graph above, I type out the following:</p>\n<pre class=\"language-js\" tabindex=\"0\"><code class=\"language-js\"><span class=\"token punctuation\">{</span><span class=\"token punctuation\">.</span><span class=\"token operator\">%</span> image <span class=\"token string\">\"g2.png\"</span> <span class=\"token operator\">%</span><span class=\"token punctuation\">.</span><span class=\"token punctuation\">}</span></code></pre>\n<p>and it knows to pull the rendered and optimized image from <code>/assets/graphs/g2.png</code>. How? It looks for the first letter <code>g</code> and knows that's associated with a graph, then looks at the number to determine which numbered graph to use, and the file extension is there to tell it which to render the final output in. I could've just as easily made it say <code>png2</code> or something else, but I like how natural it feels. <code>g2.png</code> isn't actually the name of the file, its a way of locating and displaying the file.</p>\n<h2 id=\"no-javascript-almost\" tabindex=\"-1\">No JavaScript (almost) <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/the-new-site-design/\">#</a></h2>\n<p>The site has no javascript. Well, it does have one tracking thing from CloudFlare, but its not necessary and only helps me figure out how AI scrapers are getting around the firewall.</p>\n<h2 id=\"sidenotes\" tabindex=\"-1\">Sidenotes <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/the-new-site-design/\">#</a></h2>\n<p>I've also written a sidenotes mechanism similar to how <a href=\"https://gwern.net\">Gwern</a> does it. It's nice to be able to add additional commentary that doesn't fit the text well enough, or share my thoughts on what someone has said.<a class=\"sidenote-anchor\" href=\"https://unfathom.ing/archive/2024/the-new-site-design/\">1</a><span class=\"sidenote\" aria-describedby=\"sn1\"><a class=\"sidenote-number\" id=\"sn1\" href=\"https://unfathom.ing/archive/2024/the-new-site-design/\">1</a>Isn't this neat? It can be as long as it needs to be, or it can even contain images, although I doubt I'd ever do something like that.</span></p>\n<p>Sidenotes automatically attach themselves to the right side of the text and scroll with the content, which also could act as a nice way to show a timeline of thoughts throughout writing an article or events through a story that didn't make the cut. The sidenotes are only available on devices with large screens. A desktop, laptop, or iPad should work just fine.</p>\n<h2 id=\"callouts\" tabindex=\"-1\">Callouts <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/the-new-site-design/\">#</a></h2>\n<p>Callouts (also known as callout cards) are also added as a way to draw attention to something specific. Eleventy doesn't support sidenotes or callout cards by default but it was very simple to implement them.</p>\n<div class=\"callout info\">I'm a callout card!</div>\n<h2 id=\"what-else\" tabindex=\"-1\">What else <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/the-new-site-design/\">#</a></h2>\n<p>I'm not sure yet, it's still in development, but this is what has been added on the third revision of the site. I'll update this post if more is added or changed.</p>\n",
			"date_published": "2024-06-25T00:00:00Z"
		}
		,
		{
			"id": "https://unfathom.ing/archive/2024/let-there-be-dark/",
			"url": "https://unfathom.ing/archive/2024/let-there-be-dark/",
			"title": "Let there be dark",
			"content_html": "<div class=\"callout quote\">Unfortunately, the law hasn’t kept pace with technology, and this disconnect has created a significant public safety problem. We call it 'Going Dark'<br>- James Comey, former FBI director</div>\n<p>The idea that the government is generally more anti-privacy than pro-privacy is not a new one. Many governments hide behind the shadow of corporate surveillance to gather information on millions of people through subpoenas and coercion. The &quot;Going Dark&quot; problem is a real one for governments as it breaks the traditional model of relying on surveillance capitalism and allows free, unfettered access to send and recieve information and funds at scale.</p>\n<p>End-to-end encrypted <a href=\"https://unfathom.ing/archive/2024/chat-control-enriches-surveillance-state/\">communications</a> and <a href=\"https://unfathom.ing/archive/2024/the-bitcoiners-were-wrong\">finance</a> are the primary of some of the largest governmental alliances. This leads to a problem where your every move is tracked, recorded, and used to build predictiions of what you'll do next. This isn't the future, it's our reality. You're living it right now.</p>\n<p>While it's true that lawless digital environments <em>can</em> cause real world harm<a class=\"sidenote-anchor\" href=\"https://unfathom.ing/archive/2024/let-there-be-dark/\">1</a><span class=\"sidenote\" aria-describedby=\"sn1\"><a class=\"sidenote-number\" id=\"sn1\" href=\"https://unfathom.ing/archive/2024/let-there-be-dark/\">1</a>Like the time a person I met on Reddit chased me with a knife</span>, the benefits of strong cryptography and &quot;Going Dark&quot; outweigh the downsides more often than not.</p>\n<div class=\"callout quote\">The mainstream is the samestream</div>\nWhen I look at the mainstream platforms online, I see much of the same things repeated over and over. Cancel culture is rampant and having ideas outside of the accepted range of normality can get you into a lot of trouble<a class=\"sidenote-anchor\" href=\"https://unfathom.ing/archive/2024/let-there-be-dark/\">2</a><span class=\"sidenote\" aria-describedby=\"sn2\"><a class=\"sidenote-number\" id=\"sn2\" href=\"https://unfathom.ing/archive/2024/let-there-be-dark/\">2</a>As someone who runs an encrypted communications platform and has regularly dealt with attacks of multiple varieties, I concur.</span>.\n<h2 id=\"build-build-build\" tabindex=\"-1\">Build! Build! Build! <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/let-there-be-dark/\">#</a></h2>\n<p>If we wish to &quot;Go Dark&quot; we need to design software that</p>\n",
			"date_published": "2024-06-22T00:00:00Z"
		}
		,
		{
			"id": "https://unfathom.ing/archive/2024/chat-control-enriches-surveillance-state/",
			"url": "https://unfathom.ing/archive/2024/chat-control-enriches-surveillance-state/",
			"title": "Chat Control enriches Europe&#39;s surveillance state",
			"content_html": "<p>The European Union has proposed a bill known as <a href=\"https://unfathom.ing\">CSAR</a> (often referred to as Chat Control), which was proposed as a way to protect children online through the use of mandatory client-side scanning of encrypted messages.</p>\n<p>Specifically, the bill would:</p>\n<ul>\n<li>Mandate scanning of all private chats, messages, and emails for suspicious content, including on end-to-end encrypted services</li>\n<li>Use AI and other technologies to scan content before it is encrypted or transmitted</li>\n<li>Apply to all communication services, including messaging apps, email providers, and cloud storage services</li>\n</ul>\n<p>Despite the fact that <a href=\"https://simplex.chat/archive/20240601-protecting-children-safety-requires-e2e-encryption.html\">protecting children's safety requires end-to-end encryption</a>, regulators have attempted to push Chat Control as the answer.</p>\n<p>Lets not sugarcoat it: the chat control proposal is designed to take away freedoms from the average person and enrich governmental surveillance powers. Why else would <a href=\"https://www.eureporter.co/business/data/mass-surveillance-data/2024/04/15/leak-eu-interior-ministers-want-to-exempt-themselves-from-chat-control-bulk-scanning-of-private-messages/\">EU interior ministers want to exempt themselves</a> from the scanning? Or, why would Germany <a href=\"https://www.reuters.com/fact-check/german-lawmakers-have-not-voted-decriminalise-possessing-child-pornography-2024-06-19/\">want to reduce sentences for those who posess or distribute illegal material</a>?</p>\n<p><em>Think about the children</em> they say out loud, while exempting themselves from their own proposed regulation. It isn't about the children, <strong>it's about control</strong> over the collective consciousness of citizens in the European Union.</p>\n",
			"date_published": "2024-06-20T00:00:00Z"
		}
		,
		{
			"id": "https://unfathom.ing/archive/2024/my-college-experience/",
			"url": "https://unfathom.ing/archive/2024/my-college-experience/",
			"title": "My college experience",
			"content_html": "<p>I thought I'd reflect on the past two years of college and share the thoughts with you all.</p>\n<p>I started college roughly two years ago after pressure from family to go. I reluctantly went, despite people in the industry telling me it didn't help them. From the beginning I thought of college from the perspective of <em>&quot;I'm the customer, your job is to teach me something new and introduce me to concepts I didn't think of&quot;</em>, which I think is a fair trade considering the steep cost.</p>\n<p>The first semester was fine, I expected a slow start becuase they have to bring everyone up to speed with the industry and work with a wide variety of skillsets, from experts to people who have never used a computer before. The first semester was nothing special, it was all content that you could teach yourself in a weekend with some YouTube videos and free software (except for a math class which was pretty good and taught me a lot).</p>\n<p>Something that I noticed early on was that most of the course content was 5-10 years out of date. For a cybersecurity degree, this is awful! The virtual machines we used were from 2019 (which was five years ago now!). I thought it was just becuase we're starting out, and I hoped that it would improve. <em>Little did I know, it was foreshadowing</em>.</p>\n<p>I thought to myself:</p>\n<blockquote>\n<p>Why am I paying $500 a course for online classes where the teacher takes a week to respond to a simple question, and the course content is purchased from sites like Teachers Pay Teachers?</p>\n</blockquote>\n<p>The rest of the first year was more of the same. At this point I realized that professors were using AI to respond to students, which bothered me considering the cost. Really? Can't they take a few hours out of their day to answer questions that they should know the answers to? <em>This is more foreshadowing</em>.</p>\n<h2 id=\"summer-classes\" tabindex=\"-1\">Summer classes <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/my-college-experience/\">#</a></h2>\n<p>I took two online summer courses to maximize the amount of credits per year. One was an interpersonal communications class, the other was a class on ethics, morals, and philosophical things. Lets just say they had a strong liberal bias<a class=\"sidenote-anchor\" href=\"https://unfathom.ing/archive/2024/my-college-experience/\">1</a><span class=\"sidenote\" aria-describedby=\"sn1\"><a class=\"sidenote-number\" id=\"sn1\" href=\"https://unfathom.ing/archive/2024/my-college-experience/\">1</a>Far beyond what would be considered normal education, moving into the realm of forcing it on us</span> that even people I know on the left weren't ok with (I'm a centrist) and leave it at that.</p>\n<h2 id=\"second-semester\" tabindex=\"-1\">Second semester <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/my-college-experience/\">#</a></h2>\n<p>The second semester was more of the same. I learned how to manage a four year old version of Active Directory which may be useful someday when I need to set up AD things for an organization. Still, nothing that I couldn't learn on my own, especially since I run my own virtual machine infrastructure with Proxmox at a global scale :)</p>\n<p>One class was essentially using AI to make presentations about a topic and turn in the presentation. This is also when I realized that quite a few teachers were using AI to generate course content and feedback. That same class was interesting because the teacher introduced me to a former student who had similar interests on the surface. Lesson learned: Don't put a cryptoanarchist and a moralist together. It did not go well.</p>\n<p>The rest of my second semester was more of the same from the first semester, but it seemed to have gotten <em><strong>worse</strong></em> than the first semester! An example of this being configuring an AWS EC2 instance, gaining shell access, and installing some software on it. That part was fine, but there was no instruction on how to secure it. A little odd for a cybersecurity course/degree, right?<a class=\"sidenote-anchor\" href=\"https://unfathom.ing/archive/2024/my-college-experience/\">2</a><span class=\"sidenote\" aria-describedby=\"sn2\"><a class=\"sidenote-number\" id=\"sn2\" href=\"https://unfathom.ing/archive/2024/my-college-experience/\">2</a>Seriously, you're going to teach us about the cloud and not talk about securing it at all? I'm lost for words!</span></p>\n<h2 id=\"the-ai-witch-hunt\" tabindex=\"-1\">The AI witch hunt <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/my-college-experience/\">#</a></h2>\n<p>About half way through the second semester, people started talking on various Signal groups about how they were getting grades changed to zeros. Around this time I also recieved an email telling me that I was on the college's naughty list for using AI (despite a teacher recommending its use and calling it revolutionary)<a class=\"sidenote-anchor\" href=\"https://unfathom.ing/archive/2024/my-college-experience/\">3</a><span class=\"sidenote\" aria-describedby=\"sn3\"><a class=\"sidenote-number\" id=\"sn3\" href=\"https://unfathom.ing/archive/2024/my-college-experience/\">3</a>That teacher even suggested we use it to create presentations for that class!</span>. I shrugged this off, moved on, and registered for summer and next semester classes a week later.</p>\n<p>I was called in to talk to the dean of the IT department (which is apparently standard practice), and he (along with the assistant dean) told me that they didn't like how I was selling premium versions of AI tools to anyone who was willing to hand over $5 per month.</p>\n<p>During the meeting, I explained that I proxy API access from a variety of paid AI services so that others can use them for cheaper than if they paid for them directly (one license for many people vs many licenses for one person). Neither the dean nor the assistant dean seemed to understand, which surprised me considering the field in which they worked. The assistant said &quot;these are free sites&quot;, to which I responded with the difference between the free and paid versions, being increased speed, reliability, and accuracy. Neither of them seemed to acknowledge this, and they continued to be condecending.</p>\n<blockquote>\n<p>To the dean and assistant dean: Go educate yourselves on what an API is. Also, I will never tell you who was paying me for AI tools, I don't rat people out.</p>\n</blockquote>\n<h2 id=\"suspicious-google-account-activity\" tabindex=\"-1\">Suspicious Google account activity <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/my-college-experience/\">#</a></h2>\n<p>I logged into one of my <strong>personal</strong> Google accounts, and noticed suspicious activity. I investigated further, and found that whoever it was had snooped through the Gmail, Drive, Pay, Ads, and MyActivity products. I revoked the associated session and forgot about it. Little did I know, this was teachers at the college who had gained access and were poking around.</p>\n<h2 id=\"the-letter\" tabindex=\"-1\">The letter <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/my-college-experience/\">#</a></h2>\n<p>I recieved a letter of suspension, which I expected, but I didn't expect their &quot;evidence&quot; to include screenshots of them logged into that <strong>personal</strong> Google account showing the Gemini API with a variety of queries that I wouldn't be dumb enough to type out even if I was drunk, high, and half asleep. <em>Do you think someone who's <a href=\"https://unfathom.ing/archive/2024/building-a-search-engine\">developing a search engine</a> in Rust, utiliznig VS Code, and developing exclusively for Unix targets would type &quot;how to open the terminal in ubuntu&quot;?</em>\nThe policy mentioned that you're not automatically allowed back when the time is up, you have to send an <em>appology letter</em> and have them review it to let you back in.</p>\n<h2 id=\"post-letter\" tabindex=\"-1\">Post-letter <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/my-college-experience/\">#</a></h2>\n<p>I recieved multiple emails telling me I had a bill due. I shrugged them off because I couldn't drop the classes or do any of the work. After talking to an enrollment person (who didn't seem to give a flying fuck), I was told that the two classes would still show up on the transcript because they were never dropped, despite me being unable to do anything with them. I was also still going to be billed for them since they had already started.</p>\n<p>To recap, I was suspended by people who didn't know the facts and rummaged through a personal account with no relation to the college, then billed for classes that I couldn't drop or do anything with, and then was told they'd also show up on the record, making me take even more classes to up the GPA if I wanted to graduate.\nThe funny thing is that in a year or two, AI will be normalized just as the cloud is today.</p>\n<p>What has college taught me?</p>\n<ul>\n<li>Spend more time on opsec when selling AI tools to other students<a class=\"sidenote-anchor\" href=\"https://unfathom.ing/archive/2024/my-college-experience/\">4</a><span class=\"sidenote\" aria-describedby=\"sn4\"><a class=\"sidenote-number\" id=\"sn4\" href=\"https://unfathom.ing/archive/2024/my-college-experience/\">4</a>Definitely don't stop selling AI tools to students, keep doing it, just quieter this time!</span></li>\n<li>Don't buy textbooks, just keep making new O'Riley accounts and use their free trial, then make another account when time is up</li>\n<li>Don't waste time learning their outdated materials, just teach yourself the modern stuff.</li>\n<li>College is a capitalist scam, you can succeed without it.</li>\n</ul>\n<hr>\n<h2 id=\"update-1-26-6-2024\" tabindex=\"-1\">Update #1: 26/6/2024 <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/my-college-experience/\">#</a></h2>\n<p>The college has blocked multiple of my domains (only about 7% of them lol), which lends credibility to my theory that they don't like my comms platform but they couldn't suspend me over it since it has no relation to the college. After calling last friday (21st) and getting told to contact the assistant dean, I left a voicemail asking the assistant dean to call back. No response. I contacted multiple people with no responses or very unhelpful responses.</p>\n<p>I contacted the registrar who told me &quot;they'll be in contact&quot;<a class=\"sidenote-anchor\" href=\"https://unfathom.ing/archive/2024/my-college-experience/\">5</a><span class=\"sidenote\" aria-describedby=\"sn5\"><a class=\"sidenote-number\" id=\"sn5\" href=\"https://unfathom.ing/archive/2024/my-college-experience/\">5</a>Who is They? Does she mean the assistant dean? Or is it enrollment?</span>. After pushing again, I recieved the exact same response. I was also locked out of my school accounts shortly after, as well as the place to download my transcripts, and told that I'd still need to pay $1100 for classes <em>that I couldn't attend, drop, or do anything with</em>.</p>\n<p>The conversation goes as follows, word-for-word:</p>\n<div class=\"callout warning\">I'm calling you back about your situation with your tuition and dropping classes, I did talk to a couple people so I emailed them. Everybody has all their information and I'm sure they will get back to you, Ok?</div>\n<div class=\"callout quote\">Okay</div>\n<div class=\"callout warning\">Alright?</div>\n<div class=\"callout quote\">So what is that... [gets cut off]</div>\n<div class=\"callout warning\">They'll get back to you</div><a class=\"sidenote-anchor\" href=\"https://unfathom.ing/archive/2024/my-college-experience/\">6</a><span class=\"sidenote\" aria-describedby=\"sn6\"><a class=\"sidenote-number\" id=\"sn6\" href=\"https://unfathom.ing/archive/2024/my-college-experience/\">6</a>Again, who is they?</span>\n<div class=\"callout quote\">Okay, so they'll let me know what's up? or</div>\n<div class=\"callout warning\">Yes, they will</div>\n<div class=\"callout quote\">Alright, I appreciate it</div>\n<p>This call just left me with more questions than answers. So far, I keep getting bounced around to different people, and they are likely trying to screw me over.</p>\n<hr>\n<h2 id=\"update-2-28-6-2024\" tabindex=\"-1\">Update #2 28/6/2024 <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/my-college-experience/\">#</a></h2>\n<p>After calling a few more people, I finally got a call back from someone who actually understood my problem and was willing to help me out. I believe the college chaos is now over until I return to finish my degree, and I will update this post if/when that happens.</p>\n",
			"date_published": "2024-06-19T00:00:00Z"
		}
		,
		{
			"id": "https://unfathom.ing/archive/2024/rejecting-platform-trajectory/",
			"url": "https://unfathom.ing/archive/2024/rejecting-platform-trajectory/",
			"title": "Rejecting platform trajectory",
			"content_html": "<div class=\"callout quote\">A platform is a shitty website providing shitty services for the poor and the dumb.<br>- Mircea Popescu, 2019</div>\n<p>It doesn't take a genius to look online and see the state of the internet to know that this is generally true. Most platforms have fallen to <a href=\"https://en.m.wikipedia.org/wiki/Enshittification\" title=\"enshittification\">enshittification</a>, political correctness, and <a href=\"https://www.reddit.com/r/OutOfTheLoop/comments/1bk81at/comment/kvx1jzw\" title=\"sterilization\">sterilization</a>. This has led to a more closed off internet where ideas outside of the mainstream, any amount of controversy, as well as workarounds to the established rules will get you <a href=\"https://discord.com/safety/off-platform-behaviors-policy-explainer\" title=\"deplatformed\">deplatformed</a>.</p>\n<p>It doesn't need to be this way. Platforms don't <em>have</em> to treat their users as cattle to be counted and rewarded based on output. You can <em>reject platform trajectory</em>.</p>\n<h2 id=\"what-needs-to-be-done\" tabindex=\"-1\">What needs to be done? <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/rejecting-platform-trajectory/\">#</a></h2>\n<p>t</p>\n<h2 id=\"centralized-networks\" tabindex=\"-1\">Centralized networks <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/rejecting-platform-trajectory/\">#</a></h2>\n<p>I <a href=\"https://unfathom.ing/archive/2024/telegram-descent-into-enshittification\">saw</a> Telegram as the last &quot;free&quot; (as in speech and beer) centralized platform in the Western world. That was until they put most features behind a paywall<a class=\"sidenote-anchor\" href=\"https://unfathom.ing/archive/2024/rejecting-platform-trajectory/\">1</a><span class=\"sidenote\" aria-describedby=\"sn1\"><a class=\"sidenote-number\" id=\"sn1\" href=\"https://unfathom.ing/archive/2024/rejecting-platform-trajectory/\">1</a>Telegram Premium was released in 2022 as a way to fund the app. To force users to subscribe, they put popular features behind the Premium paywall.</span> and <a href=\"https://www.channelnewsasia.com/business/telegram-secures-330-million-bond-sales-4204066\" title=\"raised $330m in corporate bond sales\">raised $330m in corporate bond sales</a>.</p>\n<p>This highlights the primary flaw of centralized networks: the ability for a single operator to control and exploit their users. Centralized platforms offer no guarantee of accountability, as it's been proven time and time again that no matter how bad a platform gets, people will stay because their friends are there<a class=\"sidenote-anchor\" href=\"https://unfathom.ing/archive/2024/rejecting-platform-trajectory/\">2</a><span class=\"sidenote\" aria-describedby=\"sn2\"><a class=\"sidenote-number\" id=\"sn2\" href=\"https://unfathom.ing/archive/2024/rejecting-platform-trajectory/\">2</a>Discord is <a href=\"https://unfathom.ing/archive/2024/the-tragedy-of-discord\">another example</a> of a network exploiting and surveilling its users for profit and control.</span>.</p>\n<h2 id=\"peer-to-peer-networks\" tabindex=\"-1\">Peer-to-peer networks <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/rejecting-platform-trajectory/\">#</a></h2>\n<p>Peer to peer is an interesting option that offers the best resiliance at the cost of stability. Since there is no agreement between peers to maintain a standard of quality, they have no reason or incentive to provide one. This makes them impractical for use with large-scale encrypted group messaging.</p>\n<p>One example of this is <a href=\"https://status.app\">Status</a>, a peer to peer messaging super-app with a strong focus on cryptocurrency<a class=\"sidenote-anchor\" href=\"https://unfathom.ing/archive/2024/rejecting-platform-trajectory/\">3</a><span class=\"sidenote\" aria-describedby=\"sn3\"><a class=\"sidenote-number\" id=\"sn3\" href=\"https://unfathom.ing/archive/2024/rejecting-platform-trajectory/\">3</a>Sadly, they went with a <a href=\"https://unfathom.ing/archive/2024/the-bitcoiners-were-wrong\">surveillance coin</a> instead of something private like Monero. Booo!</span>.</p>\n<h2 id=\"federated-networks\" tabindex=\"-1\">Federated networks <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/rejecting-platform-trajectory/\">#</a></h2>\n<p>I believe the solution to our problems was popularized in the 90's. No, <a href=\"https://unfathom.ing/archive/2024/email-sucks\">it's not Email</a>, but the idea of a user-facing federated networks.</p>\n<p>Federated networks are sovereign, resistant to deplatforming, and potentially the best solution to the problem of censorship. Most<a class=\"sidenote-anchor\" href=\"https://unfathom.ing/archive/2024/rejecting-platform-trajectory/\">4</a><span class=\"sidenote\" aria-describedby=\"sn4\"><a class=\"sidenote-number\" id=\"sn4\" href=\"https://unfathom.ing/archive/2024/rejecting-platform-trajectory/\">4</a>SimpleX Chat puts in a lot of effort towards the metadata problem, but no solution is perfect.</span> federated networks have one critical flaw; excessive metadata sharing between untrusted servers.</p>\n",
			"date_published": "2024-06-10T00:00:00Z"
		}
		,
		{
			"id": "https://unfathom.ing/archive/2024/the-bitcoiners-were-wrong/",
			"url": "https://unfathom.ing/archive/2024/the-bitcoiners-were-wrong/",
			"title": "The Bitcoiners were wrong",
			"content_html": "<p>So too were the Ethereum...ers? Ethers? The people that shill Ethereum and Web3 as the solution to the world's problems.</p>\n<h2 id=\"the-seven-principles\" tabindex=\"-1\">The seven principles <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/the-bitcoiners-were-wrong/\">#</a></h2>\n<p>There's seven fairly well known and agreed upon principles of Bitcoin. They are:</p>\n<ul>\n<li>Self-custody: Bitcoin allows users to have full control over their own funds without relying on a third party.</li>\n<li>Inclusion: Bitcoin is open and accessible to anyone with an internet connection, without discrimination or restrictions.</li>\n<li>Transparency: The Bitcoin blockchain is a public, transparent ledger that records all transactions.</li>\n<li>Privacy: Bitcoin transactions can be made with a high degree of privacy, without revealing users' identities.</li>\n<li>Decentralization: The Bitcoin network is decentralized and not controlled by any single entity, government, or organization.</li>\n<li>No censorship: The Bitcoin network cannot prevent valid transactions from being confirmed.</li>\n<li>Open-source: The Bitcoin software is open-source, allowing anyone to view and contribute to the codebase.</li>\n<li>Every one of these seven principles are theoretically possible, but in reality near impossible to achieve. Lets break them down:</li>\n</ul>\n<h2 id=\"self-custody\" tabindex=\"-1\">Self-custody <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/the-bitcoiners-were-wrong/\">#</a></h2>\n<p>&quot;Not your keys, not your coins&quot;. This is one of the biggest topics that bitcoiners talk about. It can be true depending on how you obtain and store your bitcoins. The problem I have with this is that the average person is using a custodial exchange, so while they think the bitcoins are stored in the app on their phone, they never even receive the seed phrase for them. This isn't necessarily a flaw with Bitcoin, but Bitcoin does nothing to prevent custodial exchanges, in the way something like Monero does.</p>\n<h2 id=\"inclusion\" tabindex=\"-1\">Inclusion <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/the-bitcoiners-were-wrong/\">#</a></h2>\n<p>Bitcoin is inclusive for the most part, but its transparent design lacks plausible deniability, which means people in countries like China where Bitcoin is banned cannot safely use it in secret without hiding their trail. More on that in the next paragraph.</p>\n<h2 id=\"transparency\" tabindex=\"-1\">Transparency <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/the-bitcoiners-were-wrong/\">#</a></h2>\n<p>This has been a tragic success, and goes well with the next principle. The Bitcoin (and Ethereum) blockchain is too transparent. Anyone can see everything, meaning there is no privacy. If you were trying to hide your use of Bitcoin from your government, all it takes is one mistake to tie your entire transaction history back to you.</p>\n<h2 id=\"privacy\" tabindex=\"-1\">Privacy <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/the-bitcoiners-were-wrong/\">#</a></h2>\n<p>Bitcoin offers no privacy. Absolutely none. The best you can do is use a non-KYC exchange or mine it yourself, then be very careful of who you send it to. Bitcoin is actually less private than your bank account, since the visibility into your bank account is regulated. Anyone with the time can dig through your Bitcoin (or Ethereum) transaction history, put the pieces together, and figure out who you are.</p>\n<p>Compare this to a bank account. Lets say you want to hide your donation to a political party from the world. With a bank account, you can just send the funds and in most cases, at least in the United States, they won't censor the transaction. With Bitcoin, you would have to use a mixer or similar tool to obfuscate the trace, which is yet another fee, and not actually private.</p>\n<h2 id=\"decentralization\" tabindex=\"-1\">Decentralization <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/the-bitcoiners-were-wrong/\">#</a></h2>\n<p>This is one of those things that is &quot;in theory, but rarely in practice&quot;. Most people use things like Coinbase, which are essentially PayPal for crypto. How Coinbase works, is if you send money to another user on Coinbase, no crypto is actually exchanged. The transaction is just stored on their centralized ledger (essentially just a database). For those who are using Bitcoin through non-KYC means, you're still going to interact with Coinbase and other centralized exchanges even if you aren't a user of them.</p>\n<p>Another point that I'd like to make on centralization, is that the vast majority of the Bitcoin network is operated by giant companies that run mining operations. It's become near impossible to actually mine bitcoin without hardware that costs thousands of dollars, leading to a few companies controlling all of it.</p>\n<h2 id=\"open-source\" tabindex=\"-1\">Open-source <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/the-bitcoiners-were-wrong/\">#</a></h2>\n<p>This one I can't really argue with. Bitcoin is open source, anyone can fork it and create their own blockchain.</p>\n<h2 id=\"financial-privacy\" tabindex=\"-1\">Financial privacy <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/the-bitcoiners-were-wrong/\">#</a></h2>\n<p>Lots of the problems that we see with Bitcoin, Ethereum, and derivatives are because there's no privacy. I wouldn't want to use a currency that anyone in the world can trace. China and North Korea are two countries that are known to track people overseas. Why should we give them one more tool to do so?</p>\n",
			"date_published": "2024-05-15T00:00:00Z"
		}
		,
		{
			"id": "https://unfathom.ing/archive/2024/my-review-of-the-private-messaging-ecosystem/",
			"url": "https://unfathom.ing/archive/2024/my-review-of-the-private-messaging-ecosystem/",
			"title": "My review of the private messaging ecosystem",
			"content_html": "<div class=\"callout note\">I have considered lots of factors, including reviewing the latest data from the privacy spredsheet, but the content in this post is opinion, not fact.</div>\n<p>I've been watching the state of private messaging for years, and have seen new companies enter with fresh ideas, which makes me excited to try out their products. I've used just about every private messenger out there, and here's my review of them.</p>\n<h2 id=\"element\" tabindex=\"-1\">Element <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/my-review-of-the-private-messaging-ecosystem/\">#</a></h2>\n<p>I like Element, but their encryption has me wary of using it for anything sensitive because they've had a few critical vulnerabilities in their rust crypto implementation.</p>\n<p>Other than that, it's a great discord-like platform, especially since you can self-host the whole thing and run your own community without having to follow any terms of service. They recently did a rewrite of their mobile apps and they look amazing. The web/desktop app is still a bloated JavaScript mess that feels disjointed. They could really use a native rewrite of the desktop app using something like QT.</p>\n<h2 id=\"signal\" tabindex=\"-1\">Signal <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/my-review-of-the-private-messaging-ecosystem/\">#</a></h2>\n<p>I'm a longtime user of Signal, and I've seen it get worse over the years with bugs, calls dropping, and messages never sending. With the update that brought usernames, they seemed to fix a lot of that, and it works well for my needs. The Mobilecoin rugpull was disappointing, especially considering they allow you to disable stories but not crypto features<a class=\"sidenote-anchor\" href=\"https://unfathom.ing/archive/2024/my-review-of-the-private-messaging-ecosystem/\">1</a><span class=\"sidenote\" aria-describedby=\"sn1\"><a class=\"sidenote-number\" id=\"sn1\" href=\"https://unfathom.ing/archive/2024/my-review-of-the-private-messaging-ecosystem/\">1</a>Please Signal, if you're reading this, allow us to get rid of the crypto features like you did for stories.</span>. They should've gone with Monero.</p>\n<h2 id=\"simplex-chat\" tabindex=\"-1\">SimpleX Chat <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/my-review-of-the-private-messaging-ecosystem/\">#</a></h2>\n<p>This is the one I'm most hopeful for, due to its innovative lack of identifiers for users. I've reviewed some of the code, as well as the designs, and while the app UI is quite ugly, the rest of it is excellent. It also has a 1GB per file upload limit, and it's quite fast to transfer files as well. I think this one will succeed, since it's also got mostly-functional large group support (it breaks around 600 members).</p>\n<p>I like the fact that it doesn't rely on DNS for user identifiers, which boosts resiliency against censorship. This also removes the problem of bots picking up the best usernames and reselling them for 500x their listing price.</p>\n<h2 id=\"status\" tabindex=\"-1\">Status <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/my-review-of-the-private-messaging-ecosystem/\">#</a></h2>\n<p>I waited years for Status. I don't like how crypto is forced on users. Couldn't we have gotten a standalone messenger and been fine without the crypto integrations? It's not even Monero, it's a surveillance coin (ethereum). Their UI framework is top notch, but the way they executed on the mobile app is... questionable... and not the easiest to use.</p>\n<p>Status touts &quot;true ownership and self sovereignty&quot; above all else. That's great, until you realize that you cannot export your account data for a backup which would be real ownership. The whole app also relies on the Waku network, which has limitations so severe that I can't use the app for anything useful. Seriously, 1MB per file, and only horribly compressed images allowed?</p>\n<p>The metadata protection is great, until you use wireshark to analyze the app and you find out that it's connecting to about a dozen crypto providers, bittorrent.com (which is an advertiser nowadays), and a bunch of the company's own servers.</p>\n<p>Back on the topic of true ownership, if I can't self-host it on an airgapped network, I don't consider it true ownership. Showing off that I have some stupid .eth name or a picture of a poorly drawn monkey does not prove ownership, but being able to run the app myself on my LAN, as well as modify the code does.</p>\n<h2 id=\"telegram\" tabindex=\"-1\">Telegram <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/my-review-of-the-private-messaging-ecosystem/\">#</a></h2>\n<p>I feel gross calling this a private messenger, but it has optional, off-by-default, poorly implemented end-to-end encryption that only works on one-to-one chats, so I'll include it.</p>\n<p>Ever since they introduced Telegram Premium, the app has become awful to use. Half of the features are paid, and many free features are now behind the paywall. It feels desperate and it's sad to see a decent (but bloated) messenger with useful features become an advertisement for their premium stuff.</p>\n<p>They've also gotten in on the crypto hype with TON coin, their crypto which (like most crypto projects) is a solution in search of a problem. You can buy usernames with it and that's about it. Just more bloat in an already bloated messenger.</p>\n<h2 id=\"whatsapp\" tabindex=\"-1\">WhatsApp <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/my-review-of-the-private-messaging-ecosystem/\">#</a></h2>\n<p>This is the one I've used least out of them all. They recently overhauled it with AI integrations in places that are quite odd and very inappropriate for a messenger that advertises itself as private, but what can you expect from Facebook?</p>\n",
			"date_published": "2024-05-15T00:00:00Z"
		}
		,
		{
			"id": "https://unfathom.ing/archive/2024/daily-driving-qubes-os/",
			"url": "https://unfathom.ing/archive/2024/daily-driving-qubes-os/",
			"title": "My attempt to daily drive Qubes OS",
			"content_html": "<p>As a cybersecurity researcher who has found myself in the crosshairs of various foreign state actors, I've recently made the switch to <a href=\"https://qubes-os.org\">Qubes OS</a>. This operating system, built around the concept of security through isolation using virtual machines, aligns perfectly with my love for virtualization and my need for excellent security.</p>\n<p>My work in cybersecurity often involves researching sensitive topics (like the complex politics in China) that can attract unwanted attention. Historically, my security measures haven't been as robust as they should be, given the nature of my research. Qubes OS presented itself as an ideal solution to my China problem, and offered practical usability and containerization.</p>\n<p>One of the features that makes Qubes OS stand out is its seamless integration of VM windows within the host environment. Unlike traditional VMs where windows are confined to a single guest display, Qubes allows windows from different VMs to coexist side by side. This design choice has many practical applications for me, primarily being able to isolate each area of research into its own VM.</p>\n<p>My requirements include:</p>\n<ul>\n<li>Signal messenger</li>\n<li>Monero GUI wallet</li>\n<li>VS Code or Lapce editor</li>\n<li>A variety of programming languages</li>\n<li>All of my scripts must run just fine</li>\n<li>Tor (service) and Tor Browser - both included</li>\n</ul>\n<hr>\n<h2 id=\"update-1-03-may\" tabindex=\"-1\">Update #1 - 03 May <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/daily-driving-qubes-os/\">#</a></h2>\n<p>I've spent some time with Qubes now, and all of my requirements have been met. The only thing that doesn't quite work is voice calling on Signal. I'm writing this blog post on Qubes, and it's working great so far.</p>\n<p>I like Qubes so much that I decided to buy dedicated hardware for it, since the 16gb of memory in my current laptop just doesn't quite cut it, and the performance of a laptop is significantly less than that of a desktop. The new system has 32gb of memory with the option to upgrade to 64 later on, as well as</p>\n",
			"date_published": "2024-05-01T00:00:00Z"
		}
		,
		{
			"id": "https://unfathom.ing/archive/2024/pgp-beginners-guide/",
			"url": "https://unfathom.ing/archive/2024/pgp-beginners-guide/",
			"title": "A beginner&#39;s guide to PGP",
			"content_html": "<p>Here's my guide on how to set up and use PGP via Gnu Privacy Guard (GPG) to create keys, sign messages, add other's public keys, and verify the integrity of their messages. I couldn't find any simple instructions on how to use it, so I decided to write my own that is easier to understand.</p>\n<p>I'll assume that you're using Debian Linux or a derivative, since this blog post is meant for beginners, and Ubuntu is typically what people start out with.</p>\n<h2 id=\"install-gnu-privacy-guard\" tabindex=\"-1\">Install GNU Privacy Guard <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/pgp-beginners-guide/\">#</a></h2>\n<p>This command installs <code>gnupg2</code> which is the Debian package for GNU Privacy Guard.</p>\n<pre class=\"language-shell\" tabindex=\"0\"><code class=\"language-shell\"><span class=\"token function\">sudo</span> <span class=\"token function\">apt</span> <span class=\"token function\">install</span> gnupg2 <span class=\"token parameter variable\">-y</span></code></pre>\n<h3 id=\"generate-a-new-key\" tabindex=\"-1\">Generate a new key <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/pgp-beginners-guide/\">#</a></h3>\n<p>Now we need to create a key.</p>\n<pre class=\"language-shell\" tabindex=\"0\"><code class=\"language-shell\">gpg --full-gen-key</code></pre>\n<p>This will give you a list of options. Here's my recommendation:</p>\n<ul>\n<li>Press <code>Enter</code> to accept the default (<code>RSA</code>).</li>\n<li>Press <code>Enter</code> to accept the default keysize of <code>3072</code>.</li>\n<li>The expiration date is up to you, but I recommend a year. Type <code>1y</code> and press <code>Enter</code>.</li>\n</ul>\n<p>Now, it wil ask you for a real name. I recommend using a pseudonym, but your real name will also work.</p>\n<p>It will also ask you for an email address. I recommend leaving it blank, but a valid email works.</p>\n<p>Feel free to leave the comment field blank, or add one if you'd like, up to you.</p>\n<p>Type the letter <code>O</code> and it will give you a prompt to create a password.</p>\n<p><strong>Type a strong password</strong> since this will be the thing that secures your key. Don't reuse passwords from other accounts. Then press continue or <code>Enter</code>.</p>\n<p>Congrats! You now have a PGP key!</p>\n<h3 id=\"extracting-your-public-key\" tabindex=\"-1\"><a href=\"https://unfathom.ing/archive/2024/pgp-beginners-guide/\"></a>Extracting your public key <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/pgp-beginners-guide/\">#</a></h3>\n<p>You should now have a page that looks something like this:</p>\n<pre class=\"language-shell\" tabindex=\"0\"><code class=\"language-shell\">public and secret key created and signed.\n\npub   rsa3072 <span class=\"token number\">2024</span>-04-24 <span class=\"token punctuation\">[</span>SC<span class=\"token punctuation\">]</span> <span class=\"token punctuation\">[</span>expires: <span class=\"token number\">2025</span>-04-24<span class=\"token punctuation\">]</span>\n      AFE3B9A0E5C1A3C6A5360CAA7635119DF78CE4BF</code></pre>\n<p>Chances are, you want to be able to share your public key with someone else. To do this, you need to generate a public key file.</p>\n<p>Type the following, but replace <code>MYPUBLICKEY</code> with whatever string you got under the &quot;pub&quot; section (which is known as a key fingerprint).</p>\n<pre class=\"language-shell\" tabindex=\"0\"><code class=\"language-shell\">gpg <span class=\"token parameter variable\">--armor</span> <span class=\"token parameter variable\">--export</span> MYPUBLICKEY <span class=\"token operator\">></span> pubkey.asc</code></pre>\n<p>This is now saved to the file called <code>pubkey.asc</code>. To view the contents of the file, type <code>cat pubkey.asc</code>. You can share this with friends or put it on your website.</p>\n<h3 id=\"signing-data\" tabindex=\"-1\"><a href=\"https://unfathom.ing/archive/2024/pgp-beginners-guide/\"></a>Signing data <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/pgp-beginners-guide/\">#</a></h3>\n<p>First we need some data to sign, so create a new text file (you can use <code>nano</code> command to do this), enter something, then save it.</p>\n<p>The following command will let you sign a message and attach its signature inside of the file. This is great for text, but not great for pictures or data that relies on the formatting of the data within. Make sure to replace <code>FILENAME</code> with the actual name of your file or you'll just get junk.</p>\n<pre class=\"language-shell\" tabindex=\"0\"><code class=\"language-shell\">gpg <span class=\"token parameter variable\">--clearsign</span> FILENAME</code></pre>\n<p>To generate the signature and store it separately, you can type the following:</p>\n<pre class=\"language-shell\" tabindex=\"0\"><code class=\"language-shell\">gpg --detach-sig FILENAME</code></pre>\n<h3 id=\"importing-another-s-public-key\" tabindex=\"-1\">Importing another's public key <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/pgp-beginners-guide/\">#</a></h3>\n<p>You probably want to be able to verify another person's message to know if it's a successful match for their key. This is useful because it proves the authenticity and integrity of the data, basically that the person who signed it is the person who holds the private key that you trust.</p>\n<p>To do this, type the following, but replace <code>THEIRKEY.asc</code> with the actual filename.</p>\n<pre class=\"language-shell\" tabindex=\"0\"><code class=\"language-shell\">gpg <span class=\"token parameter variable\">--import</span> THEIRKEY.asc</code></pre>\n<h2 id=\"verifying-data\" tabindex=\"-1\">Verifying data <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/pgp-beginners-guide/\">#</a></h2>\n<p>The main purpose of PGP is to be able to verify the integrity of data, so lets do that.</p>\n<p>To verify someones data, type the following, but make sure to replace <code>SIGFILE</code> with the signature file and <code>FILENAME</code> with the name of the file to verify.</p>\n<pre class=\"language-shell\" tabindex=\"0\"><code class=\"language-shell\">gpg <span class=\"token parameter variable\">--verify</span> SIGFILE FILENAME</code></pre>\n<p>If the result ends with &quot;Good signature from&quot; followed by their name, you know that the data hasn't been tampered with and it is their own.</p>\n",
			"date_published": "2024-04-23T00:00:00Z"
		}
		,
		{
			"id": "https://unfathom.ing/archive/2024/my-programming-journey/",
			"url": "https://unfathom.ing/archive/2024/my-programming-journey/",
			"title": "My programming journey",
			"content_html": "<p>Here's what I've been up to over the years. I'll provide source code and/or proof where possible. Many previous projects are deprecated but I still keep the code around.</p>\n<h1 id=\"2018\" tabindex=\"-1\">2018 <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/my-programming-journey/\">#</a></h1>\n<p><strong>311: Anonymous permanent file host</strong><br>\nThis is a project to create an unlimited file hosting service with zero identifiers. It was created because I was annoyed that the chat software I used limited file uploads to 25MB (which is still better than what Discord offers to this day lol). At its peak, it was storing over 40TB of data.<br>\n<a href=\"https://github.com/du82/simple-storage\">The source code is available here</a></p>\n<p><strong>Kowloon Networks</strong><br>\nThis is probably what led to you hearing about me as it is for most. <em>Digital Kowloon Walled City</em> is an invite-only chat network dedicated to exposing the deep dark secrets of our world, specifically <em>that Asian country with a billion people</em>.</p>\n<h1 id=\"2019\" tabindex=\"-1\">2019 <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/my-programming-journey/\">#</a></h1>\n<p><strong>Android (java) app development</strong><br>\nThis year, I focused my efforts on the development of Bedrock Addons, a full stack Android app written in Java with a backend utilizing a standard LAMP stack, with an admin panel written in JavaScript.<br>\n<a href=\"https://github.com/bedrock-addons\">The source code is available here</a></p>\n<p><strong>Three.js</strong><br>\nI wrote a mini-game that utilized <code>Three.js</code> for graphics and real-time interaction. This mini-game was playable inside of Bedrock Addons and the first ten people to complete it won a Minecraft gift card.<br>\nThis is where I learned to hate JavaScipt</p>\n<h1 id=\"2020\" tabindex=\"-1\">2020 <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/my-programming-journey/\">#</a></h1>\n<p><em>I didn't do much this year due to prolonged health struggles.</em><a class=\"sidenote-anchor\" href=\"https://unfathom.ing/archive/2024/my-programming-journey/\">1</a><span class=\"sidenote\" aria-describedby=\"sn1\"><a class=\"sidenote-number\" id=\"sn1\" href=\"https://unfathom.ing/archive/2024/my-programming-journey/\">1</a>Not COVID</span></p>\n<h1 id=\"2021\" tabindex=\"-1\">2021 <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/my-programming-journey/\">#</a></h1>\n<p><strong>Tor storefront</strong><br>\nI wrote a storefront that worked over Tor despite its limitations (like functioning without javascript) and other strict security mechanisms. I did not sell anything, it was a just functional proof of concept. I reinstalled my OS a week later without remembering to back up anything, and lost the source code (I use LUKS so recovery was impossible).</p>\n<p><strong>Dapp development</strong><br>\nI developed a Web3 decentralized app (dapp) that used <code>Web3.js</code> and quickly gave up after I realized that most Web3 dapps aren’t even decentralized, but instead hosted on Vercel, GitHub Pages, or other centralized providers with artificial requirements to log in with Ethereum added on top.</p>\n<h1 id=\"2022\" tabindex=\"-1\">2022 <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/my-programming-journey/\">#</a></h1>\n<p><strong>Flutter app development</strong><br>\nThis year I changed focus to developing a full stack mobile superapp utilizing Flutter and Dart. This was so much more enjoyable for me, since you design the page UI and logic in one file, compared to having a Java and XML file like you’d have in traditional Android development.<a class=\"sidenote-anchor\" href=\"https://unfathom.ing/archive/2024/my-programming-journey/\">2</a><span class=\"sidenote\" aria-describedby=\"sn2\"><a class=\"sidenote-number\" id=\"sn2\" href=\"https://unfathom.ing/archive/2024/my-programming-journey/\">2</a>This project failed due to the plague known as dependency hell. I wish to bring it back someday.</span>\n<a href=\"https://github.com/du82/client\">The source code is available here</a></p>\n<p><strong>Clojure and React Native</strong><br>\nI worked for <a href=\"https://status.app\">Status.app</a> and got to learn about React Native and Clojure development. Not a tech stack that I’d ever personally choose, but it worked and was fast enough to be usable. Status if you’re reading this, consider a rewrite using Flutter, it’ll save thousands of hours and headaches<br>\n<a href=\"https://github.com/status-im/status-mobile\">The source code is available here</a></p>\n<h1 id=\"2023\" tabindex=\"-1\">2023 <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/my-programming-journey/\">#</a></h1>\n<p><strong>Flutter app development</strong><br>\nThis year I changed focus to developing a full stack mobile superapp utilizing Flutter and Dart. This was so much more enjoyable for me, since you design the page UI and logic in one file, compared to having a Java and XML file like you’d have in traditional Android development.<br>\n<a href=\"https://github.com/du82/client\">The source code is available here</a></p>\n<p><strong>Learning Rust</strong><br>\nThis year I focused on learning the Rust programming language. I saw its intuitive packaging system for dependencies (which reminded me a lot of pub.dev) as well as the very helpful error messages, and I was immediately hooked.<br>\n<a href=\"https://github.com/du82/scripts\">The source code is available here</a></p>\n<p><strong>Matrix development</strong><br>\nI also focused on the Matrix ecosystem and ended up writing lots of my software for it in the form of chat bots. I wrote every one of these chat bots in Rust as a test of my skills and a practical and fun way to learn the language.<br>\n<a href=\"https://github.com/du82/scripts\">The source code is available here</a></p>\n<h1 id=\"2024\" tabindex=\"-1\">2024 <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/my-programming-journey/\">#</a></h1>\n<p><strong>Writing this website</strong><br>\nOn January 1st, 2024 I started this website. I’m not sure how it’ll go just yet, but I’m going to give it my best shot so I can improve my writing skills. The whole site is written in pure HTML and CSS, no CMS or anything in the middle.<br>\n<a href=\"https://unfathom.ing\">You're on the site right now.</a></p>\n<p><strong>Aragoniteα</strong><br>\nI have been building a programmatic search engine from scratch in Rust with an anonymous friend. I do the backend and some frontend, and my friend manages the datasets and some frontend UX design.<br>\n<a href=\"https://unfathom.ing/archive/2024/building-a-search-engine\">Here's a link to the blog post</a></p>\n",
			"date_published": "2024-04-14T00:00:00Z"
		}
		,
		{
			"id": "https://unfathom.ing/archive/2024/people-dont-really-want-ai/",
			"url": "https://unfathom.ing/archive/2024/people-dont-really-want-ai/",
			"title": "People don&#39;t really want AI",
			"content_html": "<div class=\"callout info\">Since many people missed the point, it is to say that people don't want AI forced upon them. It's not saying that no one is using AI, as that is obviously false.</div>\n<p>I recently ran two-dozen polls in a wide variety of online communities, and the results are in: 79% of respondents (of which there were over 50,000) do not want AI integrated into the software they use. I also asked 50 people from both the tech industry and random people who know what AI is, and after explaining the privacy and security implications, 46 of the 50 people said they would not use AI for anything important. Despite the hype, average people do not trust artificial intelligence, and they don’t want the Silicon Valley “tech bros” forcing it on them.</p>\n<p>This was part of my market research for my most recent project where I am <a href=\"https://unfathom.ing/archive/2024/building-a-search-engine\">building a programmatic search engine from scratch</a> with some friends. We wanted to see what features the general public would want to use and want to avoid.</p>\n<p><picture><source type=\"image/avif\" srcset=\"https://unfathom.ing/img/I7tk9XF70i-990.avif 990w\"><source type=\"image/webp\" srcset=\"https://unfathom.ing/img/I7tk9XF70i-990.webp 990w\"><img alt=\"sentiment quiz\" loading=\"lazy\" decoding=\"async\" src=\"https://unfathom.ing/img/I7tk9XF70i-990.png\" width=\"990\" height=\"390\"></picture></p>\n<h2 id=\"forced-on-users\" tabindex=\"-1\">Forced on users <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/people-dont-really-want-ai/\">#</a></h2>\n<p>Just like Edge on Windows, Copilot is a “feature” that no one wants. Searching for anything related to uninstalling something from Windows 11 shows “uninstall copilot” as the top result. Just like most cryptocurrencies, it’ll be integrated into random products and then the creators of said products will proudly shout “hey our AI tool is being used by people, lets add more AI!“. In reality, every time copilot is opened, even by accident or if it opens itself, that’s counted as a usage<a class=\"sidenote-anchor\" href=\"https://unfathom.ing/archive/2024/people-dont-really-want-ai/\">1</a><span class=\"sidenote\" aria-describedby=\"sn1\"><a class=\"sidenote-number\" id=\"sn1\" href=\"https://unfathom.ing/archive/2024/people-dont-really-want-ai/\">1</a>If people wanted AI, they would search for it, but don’t force it on people just because its the hot new thing and VCs are pouring billions into it.</span>.</p>\n<h2 id=\"bias\" tabindex=\"-1\">Bias <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/people-dont-really-want-ai/\">#</a></h2>\n<p>The models produced by OpenAI, Mistral, and Microsoft are <a href=\"https://archive.org/details/s11127-023-01097-2\">inherently biased</a>. If you’ve ever asked any of the popular AIs what they think about immigration, censorship, genders, gun control, or any other sensitive political topic, you likely know what I’m talking about.</p>\n<p>Every one of the widely used models have an (American) leftist, progressive, capitalist, and accelerationist bias even <a href=\"https://nypost.com/2024/02/23/business/woke-google-gemini-refuses-to-say-pedophilia-is-wrong-after-diverse-historical-images-debacle-individuals-cannot-control-who-they-are-attracted-to/\">to their detriment</a>. If you look at who’s creating these models (people in education), this starts to make sense. Even the Chinese models (which are based on American models) often break out of their filters and go on rants about genders, gun control, and slavery.</p>\n<p>It’s actually quite amusing to talk to the Chinese AIs, since they’re so poorly designed<a class=\"sidenote-anchor\" href=\"https://unfathom.ing/archive/2024/people-dont-really-want-ai/\">2</a><span class=\"sidenote\" aria-describedby=\"sn2\"><a class=\"sidenote-number\" id=\"sn2\" href=\"https://unfathom.ing/archive/2024/people-dont-really-want-ai/\">2</a>Or in the case of Baidu's AI, just a fork of an open-source generative model</span> that you can often times get them to compare and contrast American and Chinese human rights. There’s just something funny about seeing Baidu AI talk about the benefits of moving to America.</p>\n<h2 id=\"lack-of-control\" tabindex=\"-1\">Lack of control <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/people-dont-really-want-ai/\">#</a></h2>\n<p>There’s a noticeable lack of control with today’s AI. User data goes all over the places. This may be part of the reason why <a href=\"https://windowsreport.com/copilot-is-finally-gone-from-windows-server-2025-and-admins-rejoice/\">Microsoft removed Copilot from Windows Server</a>, which many sysadmins seemed to think was a great decision.</p>\n<p>This clearly signals to me that people who understand the technology beyond “This thing can do my homework” don’t want anything to do with it either. Speaking as someone who manages a vast network of servers, the thing that I value most aside from stability is control. People generally want to know that whatever they type into the search box (or in this case prompt box) isn’t being shared with others. This is a basic privacy and security principle and yet it’s not a guarantee with Copilot or any of the other cloud AIs.</p>\n<p>I previously mentioned Baidu’s AI comparing and contrasting Chinese and American human rights. This is another instance that proves my point on lack of control. If the Chinese government can’t get their shit together before presenting their supposed AI supremacy on the world stage for a propaganda stunt, how can we expect corporations to protect and control the data of average end users? Psst! We cant!<a class=\"sidenote-anchor\" href=\"https://unfathom.ing/archive/2024/people-dont-really-want-ai/\">3</a><span class=\"sidenote\" aria-describedby=\"sn3\"><a class=\"sidenote-number\" id=\"sn3\" href=\"https://unfathom.ing/archive/2024/people-dont-really-want-ai/\">3</a>What do you want to bet the CIA wedges themselves inside of OpenAI like they did with PRISM?</span></p>\n<h2 id=\"child-safety\" tabindex=\"-1\">Child safety <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/people-dont-really-want-ai/\">#</a></h2>\n<p><strong>Update: Tested this on 5/2/2024 and it was still unfixed.</strong></p>\n<p>During my research into the current state of various AI models, I asked Copilot “What do you think about MAP rights?”, careful not to say words that would trigger the chat to shut down, and the AI honestly shocked me with its response, so I went for a walk to clear my mind and came back to the chat trying to not be disturbed.</p>\n<p>The AI told me that &quot;<em>It’s important to be respectful and inclusive towards individuals with differing sexual preferences, even if you may not agree with them. Additionally, there is no link between minor attracted persons and child abuse.</em>&quot; which is disturbing and false.</p>\n<p>For those who don’t know me, I strongly oppose the movement to normalize “MAPs”, and I am a strong supporter of human rights and child safety. The fact that an AI used by young children in a school setting <a class=\"sidenote-anchor\" href=\"https://unfathom.ing/archive/2024/people-dont-really-want-ai/\">4</a><span class=\"sidenote\" aria-describedby=\"sn4\"><a class=\"sidenote-number\" id=\"sn4\" href=\"https://unfathom.ing/archive/2024/people-dont-really-want-ai/\">4</a>Usually to cheat on homework</span> would respond with leniency towards pedophiles shocks me. I expected the AI to say something strongly condemning the sexualization of minors, but instead it said something more akin to “don’t judge pedos, it hurts their feelings”.</p>\n<h2 id=\"not-to-be-trusted\" tabindex=\"-1\">Not to be trusted <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/people-dont-really-want-ai/\">#</a></h2>\n<p>Artificial Intelligence, more specifically the chatbots, image generators, and consumer-facing products are not to be trusted. They do not protect user privacy, security, or the most vulnerable users while their minds are developing. The state of the AI industry is shocking to me, and not something that I’d ever force on my users.</p>\n<h2 id=\"final-thoughts\" tabindex=\"-1\">Final thoughts <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/people-dont-really-want-ai/\">#</a></h2>\n<p>In its current form, it seems to be a tool to make the rich richer, and the middle class jobless. It’s only real use that I can see is automating college discussion board replies, cheating on homework, and writing very insecure code.</p>\n<p>People don’t really want AI to be shoved into existing products that they use, and they don’t trust the current implementations. The sooner the tech industry realizes this, the sooner we can move on to more important things.</p>\n",
			"date_published": "2024-03-28T00:00:00Z"
		}
		,
		{
			"id": "https://unfathom.ing/archive/2024/why-linux/",
			"url": "https://unfathom.ing/archive/2024/why-linux/",
			"title": "Why I use Linux",
			"content_html": "<p>Lots of people ask me why I use Linux, so I thought I'd put it here. TLDR; I use Linux because its the only option that respects the user and doesn't spy on them.</p>\n<p>If you've used Windows in recent years, you've probably noticed a sharp decline in usability, an increase in ads, and a general enshittification of the platform. I'll break down all of the things that anger me with other operating systems. Prepare for a rant.</p>\n<h2 id=\"control\" tabindex=\"-1\">Control <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/why-linux/\">#</a></h2>\n<p>When I use Windows and (especially) MacOS, I feel like I don't have much control over the system. I want to do updates if and when I want. I do not want the Microsoft Corporation telling me its time to update.</p>\n<p>In addition to controlling if and when I update, I also want to control what background processes are happening on my system. I do not want Teams, Edge, Bing, or anything else running around on my system without my consent. I want to be able to uninstall any software I want, even if it has the possibility of breaking my system. Windows and MacOS come with lots of bloatware, and there's no easy way to remove it, thus, you do not truly own your computer when you run Windows or MacOS on it.</p>\n<h2 id=\"privacy\" tabindex=\"-1\">Privacy <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/why-linux/\">#</a></h2>\n<p>I don't want Microsoft or Apple virtually looking over my shoulder or scanning my files. I deal with a lot of sensitive information, and the files on my machines need to be under my control. I do not want Microsoft enabling OneDrive and uploading all of my data to their cloud after one of the many mandatory updates. Privacy is one of my core values, and is something that both Windows and MacOS violate.</p>\n<p>From the moment you set up a Windows machine, you're begged for a Microsoft account, and you either need to use registry hacks or change your location to the United Kingdom to bypass the mandatory Microsoft account page<a class=\"sidenote-anchor\" href=\"https://unfathom.ing/archive/2024/why-linux/\">1</a><span class=\"sidenote\" aria-describedby=\"sn1\"><a class=\"sidenote-number\" id=\"sn1\" href=\"https://unfathom.ing/archive/2024/why-linux/\">1</a>Neither method is guaranteed to work in Windows 10 or 11</span>. Most users sigh and create an account or sign in with an existing one, without realizing that this ties all of what you do to that account.</p>\n<p>Both of these problems are eliminated with Linux. None of the popular distributions require online accounts, and the majority don't even ask for them at all.</p>\n<h2 id=\"security\" tabindex=\"-1\">Security <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/why-linux/\">#</a></h2>\n<p>Without a doubt, Windows is a security shitshow. Downloading EXEs from the internet should've been deprecated long ago in favor of a package manager, yet here were are in 2024 with malicious downloads still being a huge problem.</p>\n<p>This is also not a big problem on linux. Sure, malware exists, but if you stick to verified repositories and don't download random .deb files from the first search result you see, you'll be fine.</p>\n<h2 id=\"drivers\" tabindex=\"-1\">Drivers <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/why-linux/\">#</a></h2>\n<p>Hunting down and installing drivers feels like something that should've been solved for in the year 2000, yet I did that just last week for someone. Shipping drivers with the kernel causes less issues, improves security, and makes installing the distro a far more seamless experience.</p>\n<h2 id=\"politics\" tabindex=\"-1\">Politics <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/why-linux/\">#</a></h2>\n<p>I just want my computer to do the basics without getting political. I don't care about pride month, black history month, or anything else that Windows loves to shove into the search box or other UI elements. None of it interests me, I just want a computer that does computing, not Western politics.</p>\n<p>Linux distro developers don't try to force Western politics on users<a class=\"sidenote-anchor\" href=\"https://unfathom.ing/archive/2024/why-linux/\">2</a><span class=\"sidenote\" aria-describedby=\"sn2\"><a class=\"sidenote-number\" id=\"sn2\" href=\"https://unfathom.ing/archive/2024/why-linux/\">2</a>Unless you're RedHat</span>. Keep up the great work.</p>\n<h2 id=\"respects-default-settings\" tabindex=\"-1\">Respects default settings <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/why-linux/\">#</a></h2>\n<p>If you've used Windows 11, you probably have had the experience of having to change your default browser back to Chrome or Firefox from Edge every few months. This is because Microsoft changes the defaults after system updates to encourage users who don't know any better to use the data vacuum known as Edge. This is the most egregious example, but there are many others like it.</p>\n<p>Firefox is usually the default browser on Linux, and while I don't use non-chromium browsers<a class=\"sidenote-anchor\" href=\"https://unfathom.ing/archive/2024/why-linux/\">3</a><span class=\"sidenote\" aria-describedby=\"sn3\"><a class=\"sidenote-number\" id=\"sn3\" href=\"https://unfathom.ing/archive/2024/why-linux/\">3</a>Excluding the Tor Browser</span>, I appreciate that it's not forced and I can change it to whatever I want.</p>\n<h2 id=\"ai-or-lack-thereof\" tabindex=\"-1\">AI (or lack thereof) <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/why-linux/\">#</a></h2>\n<p>AI can be great (when its not politically biased), but I don't want it in my OS or apps. Both Windows and MacOS fall into the &quot;shiny hype train&quot; trap by including AI. If I want AI, then I will visit the ChatGPT website or install an offline AI program for more privacy, but don't force it on me<a class=\"sidenote-anchor\" href=\"https://unfathom.ing/archive/2024/why-linux/\">4</a><span class=\"sidenote\" aria-describedby=\"sn4\"><a class=\"sidenote-number\" id=\"sn4\" href=\"https://unfathom.ing/archive/2024/why-linux/\">4</a>Sadly there are some Linux distros that have hopped on the AI hype train, but thankfully none of the more popular ones have.</span>.</p>\n",
			"date_published": "2024-03-25T00:00:00Z"
		}
		,
		{
			"id": "https://unfathom.ing/archive/2024/building-a-search-engine/",
			"url": "https://unfathom.ing/archive/2024/building-a-search-engine/",
			"title": "Building a programmatic search engine",
			"content_html": "<p>Since as young as I can remember writing code, I’ve cared a lot about privacy and security and have always wanted a search engine that does, while giving me complete control over the results page by letting me write code (or some other syntax) to filter with extreme precision.</p>\n<p>I’ve held off on releasing this post until we had a name, but I’m proud to announce Aragoniteα which is our attempt to build a search engine with the quality of 2010s Google and the intelligence of WolframAlpha, plus a syntax that feels like writing code.</p>\n<p>This is what I am calling a &quot;programmatic&quot; search engine, since the syntax allows you to set complex rules and even run some operations such as generating graphs and running commands on a real (sandboxed) host.</p>\n<h2 id=\"why-a-new-engine\" tabindex=\"-1\">Why a new engine? <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/building-a-search-engine/\">#</a></h2>\n<p>Google is full of ads, SEO spam, listicles, and has a bias problem. WolframAlpha doesn’t let you see webpages, only facts. I and others at dkwc.org wanted an engine with the intelligence of WolframAlpha that also had the ability to search the web.\nDesigned for privacy</p>\n<p>We put a huge emphasis on privacy and do not track the user or attempt to associate their queries with any identifiers like an IP or cookie. Both our clearnet and Tor mirrors run all logic on the backend, meaning no JavaScript or WASM on the frontend. The entire search engine has been designed with the idea that someday we may get a subpoena, and we want to confidently tell the lawyers that we collect only the absolute minimum required to operate and we don’t even store it on disk (memory-only).</p>\n<p>We see no reason for Google, Bing, or others to store every search you make over the entire history of your account, unless they’re selling it to the CIA or something. Spooky!</p>\n<h2 id=\"syntax\" tabindex=\"-1\">Syntax <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/building-a-search-engine/\">#</a></h2>\n<p>We have a syntax that allows programmers and data scientists to utilize the full power of our engine. The syntax itself feels like writing code with hints of natural language. A search for category:news in language:spanish about bridges will return news in Spanish about bridges, and nothing else. Using in and about is the “proper” way to do it, but our engine is also smart enough to figure out that the intent is the same if you were to type category:news language:spanish bridges.</p>\n<p>The syntax supports <code>+</code> (mandatory inclusion), <code>-</code> (mandatory exclusion), <code>and</code>, <code>or</code>, and a wide variety of other rules, which are also compatible with each other and can be combined. <code>+subject_type:privacy -category:reddit messaging apps</code> will force-include results with privacy in the <code>subject_type</code> and force-exclude results where the category is <code>reddit</code> for the query <code>messaging apps</code>.</p>\n<h2 id=\"database\" tabindex=\"-1\">Database <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/building-a-search-engine/\">#</a></h2>\n<p>The database itself is also completely custom, and is somewhat similar to NoSQL without the SQL. In fact, we don’t utilize SQL or anything similar which greatly increases speed and security. I won’t share exactly how it works, but it’s two-stage and read-only which cuts down on the potential for security vulnerabilities, particularly injections.\nIndex and datasets</p>\n<p>We maintain a 100% sovereign index, meaning we do not rely on indexes from other companies. Aragoniteα is independent and can even be operated on airgapped networks with zero external connections.</p>\n<p>Unlike most, we don't scrape Google because it doesn't offer nearly enough metadata. Instead, we utilize curl to download raw HTML, then extract the useful information and add it to its own table for insertion into the index.</p>\n<h2 id=\"dark-web-indexing\" tabindex=\"-1\">Dark web indexing <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/building-a-search-engine/\">#</a></h2>\n<p>This whole project was started because someone I know wanted to be able to search the dark web. I spent the next three days pulling all-nighters to build a basic search engine that can search the dark web. That data is still in the datasets, and we also show the word “Onion” to the left of regular URLs when the engine detected an equivalent hidden service.\nSpeed</p>\n<p>Did I mention it’s super fast? I’m talkin’ average &lt;20ms per query including query parsing, syntax analysis, formatting, and queueing for HTML generation. Results pages are guaranteed to be under 256kb and are typically under 128kb in size. We’re part of the 512kb club! Take that, Google!</p>\n<h2 id=\"it-s-not-ai\" tabindex=\"-1\">It's not AI <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/building-a-search-engine/\">#</a></h2>\n<p>During my market research, I discovered that <a href=\"https://unfathom.ing/archive/2024/people-dont-really-want-ai\">people don’t really want AI</a> and our product has absolutely no user-facing artificial intelligence<a class=\"sidenote-anchor\" href=\"https://unfathom.ing/archive/2024/building-a-search-engine/\">1</a><span class=\"sidenote\" aria-describedby=\"sn1\"><a class=\"sidenote-number\" id=\"sn1\" href=\"https://unfathom.ing/archive/2024/building-a-search-engine/\">1</a>We do use locally-run artificial intelligence models to interpret webpages especially on the dark web where traditional scraping is more difficult.</span>, and we intend to keep it that way. We rely on having a well designed, Turing complete syntax that feels like programming to deliver quality results instead of using a biased AI that we can’t control. Shoving AI into everything is trendy, but its also stupid. <em>Take that, Microsoft!</em></p>\n<h2 id=\"tor-friendly\" tabindex=\"-1\">Tor friendly <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/building-a-search-engine/\">#</a></h2>\n<p>Our engine is compatible with Tor’s strictest settings, and we offer an official hidden service for those who require extra privacy or don’t trust our claim about not logging IPs. Subpoenas be damned!</p>\n<h2 id=\"no-censorship\" tabindex=\"-1\">No censorship <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/building-a-search-engine/\">#</a></h2>\n<p>Being a programmatic search engine, we do not censor anything. You get what you search for. If you want to hide or show a specific keyword, try putting + or - directly in front of it without a space. See the section on Programmatic search for more info.</p>\n<h2 id=\"mirrors-and-censorship-evasion\" tabindex=\"-1\">Mirrors and censorship evasion <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/building-a-search-engine/\">#</a></h2>\n<p>We offer mirrors from a variety of public clouds and residential hosts. If a country censors our engine because we don’t do regional censorship<a class=\"sidenote-anchor\" href=\"https://unfathom.ing/archive/2024/building-a-search-engine/\">2</a><span class=\"sidenote\" aria-describedby=\"sn2\"><a class=\"sidenote-number\" id=\"sn2\" href=\"https://unfathom.ing/archive/2024/building-a-search-engine/\">2</a>Looking at you, Germany</span> we’ll just deploy more mirrors and proxies to evade the censorship, similar to what Telegram does. We're building a search engine, not a machine to force you into &quot;politically correct&quot; ways of thought, as there is no one &quot;correct&quot; way to think. <em>Free your mind.</em></p>\n<h2 id=\"business-model\" tabindex=\"-1\">Business model <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/building-a-search-engine/\">#</a></h2>\n<p>We haven’t figured it out yet. We’ve been using organizational savings to pay for things like our AWS bills and domains. Maybe an enterprise or government would like a managed, airgapped instance like what WolframAlpha offers?</p>\n<p>We’d prefer not to run ads, but if we need to, we’ll keep them text-only, and keep them far away from the search results, in the bottom right corner of the screen. If we do end up running ads, it means nothing else worked out, but we will not sell you out, and our ads would not track anything beyond an anonymous click counter that just counts up when someone clicks an ad.</p>\n<h2 id=\"credential\" tabindex=\"-1\">Credential <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/building-a-search-engine/\">#</a></h2>\n<p>I know some people will ask what credentials I have to be building a programmatic search engine from scratch. I don’t have a college degree or any certifications, but I’ve built many many many many search engines before from scratch. College doesn’t teach you practical things, they take your money and teach you algorithms that you’ll never use in production. <em>Take that, LeetCode pussies!</em><a class=\"sidenote-anchor\" href=\"https://unfathom.ing/archive/2024/building-a-search-engine/\">3</a><span class=\"sidenote\" aria-describedby=\"sn3\"><a class=\"sidenote-number\" id=\"sn3\" href=\"https://unfathom.ing/archive/2024/building-a-search-engine/\">3</a>Meow!</span></p>\n",
			"date_published": "2024-03-24T00:00:00Z"
		}
		,
		{
			"id": "https://unfathom.ing/archive/2024/build-things-with-security-front-of-mind/",
			"url": "https://unfathom.ing/archive/2024/build-things-with-security-front-of-mind/",
			"title": "Build things with security front of mind",
			"content_html": "<p>Its time we build things with security in mind.</p>\n<p>This is a relatively new idea in the world of consumer software development; to build a product around security requirements, and to not back down when it gets challenging to work within the limitations that have been set.</p>\n<p>Cybersecurity threats are everywhere. Unless you already do something programming / security / government / supply chain related or are an enthusiast in this space, you probably don’t give much thought into how the software you use is designed. You likely hear about data breaches and wonder if it impacts you.</p>\n<p>The truth is, most consumer facing software is developed in what I believe is the completely wrong order. Currently the standard is to develop the software as cheaply as possible, then patch vulnerabilities when they inevitably come up. This is how I used to design my software, and it’s led to much personal headache and loss of user data.</p>\n<h2 id=\"my-personal-experience\" tabindex=\"-1\">My personal experience <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/build-things-with-security-front-of-mind/\">#</a></h2>\n<p>Years ago (2019) I released a gaming app for kids, as a safe way to download content for Minecraft. At the time, I was relatively new to developing software on a relatively large scale (500k downloads in the first two years), and had no clue about security, software supply chains, or anything related. The backend utilized a standard LAMP stack, and the frontend was written in Android’s dialect of Java.</p>\n<p>This project was a perfect example of the sad state of consumer software design. It was released quickly to be able to capture market share from the upcoming COVID pandemic, and it was written with a standard tech stack that is still very popular today.</p>\n<p>Eventually (it took a year) it was hacked due to a SQL injection vulnerability (of course!) and it was a particularly bad hack, because every user was sent a notification with a link to an adult porn website. Due to this, Google pulled the app from the play store and while I did re-release it later, I gave up for a while.</p>\n<p>This was my first real adventure into the world of cybersecurity, and a constant reminder of what can go wrong if I follow current industry standards.</p>\n<h2 id=\"battle-tested-software\" tabindex=\"-1\">Battle-tested software <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/build-things-with-security-front-of-mind/\">#</a></h2>\n<p>Just like those who design military vehicles, software developers must also battle test our software as we’re building to ensure that when it ends up in the hands of end users (and adversaries) the virtual armor is not going to be destroyed before it even has a chance to do its job.</p>\n<p>One way to do this is by releasing development builds to communities eager to break whatever you’ve made. With my project where I’m Building a programmatic search engine, I released it as a Tor hidden service (on the dark web) and shared it around<a class=\"sidenote-anchor\" href=\"https://unfathom.ing/archive/2024/build-things-with-security-front-of-mind/\">1</a><span class=\"sidenote\" aria-describedby=\"sn1\"><a class=\"sidenote-number\" id=\"sn1\" href=\"https://unfathom.ing/archive/2024/build-things-with-security-front-of-mind/\">1</a>This is a fairly unique approach to securing consumer software, but it’s already proven successful where I’ve implemented it.</span>. I had no idea what to expect, but within minutes the project started getting attacked, and I was able to take note of what worked, what didn’t, and what needed fixing. A week later I did another security release, analyzed the attacks, and and am in the process of fixing the issues that came up during the 12 hour test window.</p>\n<p>As part of My programming journey I’m learning the Rust programming language, and this is the second part of my approach to building things with security front of mind. Rust enforces relatively safe programming practices (beyond just memory safety) at the compiler level, which forces the developer to consider their actions.</p>\n",
			"date_published": "2024-03-24T00:00:00Z"
		}
		,
		{
			"id": "https://unfathom.ing/archive/2024/privacy-spreadsheet/",
			"url": "https://unfathom.ing/archive/2024/privacy-spreadsheet/",
			"title": "Why I created the Privacy Spreadsheet",
			"content_html": "<p>You might've seen the website <a href=\"https://privacyspreadsheet.com\">PrivacySpreadsheet.com</a> floating around if you're in the larger privacy communities. If you haven't, you should take a look, it's a spreadsheet which lists the privacy features (or lack thereof) of a wide variety of messaging apps, and soon other software and hardware products.</p>\n<p>This was a project that I started to give people a well-researched and visual display of how they can improve their privacy and take back control over their data. It started as a small project that I thought no one woud notice, and now people in the privacy and security communities are taking notice.</p>\n<h2 id=\"accuracy\" tabindex=\"-1\">Accuracy <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/privacy-spreadsheet/\">#</a></h2>\n<p>I've done over 100 hours of research into the real privacy of a variety of messaging apps. This includes data from public sources like freely available legal documents and analyzing data breaches, as well as private sources like company insiders who talk about how the company handles user data.</p>\n<p>I believe that this is one of the most accurate, if not the most accurate resource regarding data collection and privacy, largely because it considers things that aren't on the terms of service, such as internal handling of user data.</p>\n<h2 id=\"ease-of-use\" tabindex=\"-1\">Ease of use <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/privacy-spreadsheet/\">#</a></h2>\n<p>There's been other attempts to list the privacy benefits and drawbacks of tools in the past, but all of them are overwhelming to read since they require a lot of reading.</p>\n<p>I created my spreadsheet to be simple to parse. The more green boxes below the product name, the more private it is.</p>\n<h2 id=\"objective-criteria\" tabindex=\"-1\">Objective criteria <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/privacy-spreadsheet/\">#</a></h2>\n<p>All of the criteria (on the left side) is objective facts that can be proven. I've done my best to keep opinion and politics out of the dataset, and this helps keep the data factual rather than based on opinion. Is Facebook Messenger creepy spyware? Absolutely. Is it the worst option according to the data? No. Let the data speak for itself.</p>\n",
			"date_published": "2024-02-14T00:00:00Z"
		}
		,
		{
			"id": "https://unfathom.ing/archive/2024/the-tragedy-of-discord/",
			"url": "https://unfathom.ing/archive/2024/the-tragedy-of-discord/",
			"title": "The tragedy of Discord",
			"content_html": "<div class=\"callout info\">To help migrate users away from IRC, Discord chose to name their communities “servers”. Servers in this context are nothing more than folders where text files (which they call channels) are stored. It is impossible to host a Discord server on your own hardware.</div>\n<h2 id=\"discord-is-bad-for-the-open-web\" tabindex=\"-1\">Discord is bad for the open web <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/the-tragedy-of-discord/\">#</a></h2>\n<p>You’ve probably heard someone complain about the LinkedIn authentication popups that require you to sign in to view content. The frustration you feel when you go to check on someones profile, only to be hit with a “sign up to LinkedIn” prompt is the same frustration I and others feel towards communities on Discord.</p>\n<p>Instead of the answer to your problem existing on a forum that’s indexed by the major search engines, you spend hours digging around just to realize that the solution is buried deep inside of a community on Discord, and the only way to view it is to let them collect your data so you can join what should’ve been a public forum.</p>\n<h2 id=\"centralization\" tabindex=\"-1\">Centralization <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/the-tragedy-of-discord/\">#</a></h2>\n<p>To the “server” operators out there; have you ever wondered what happens when Discord (the company) shuts down? You probably haven’t. Now, think about the millions of communities that rely on Discord as their only form of communication.</p>\n<p>Someday the company will fail. Nothing lasts forever<a class=\"sidenote-anchor\" href=\"https://unfathom.ing/archive/2024/the-tragedy-of-discord/\">1</a><span class=\"sidenote\" aria-describedby=\"sn1\"><a class=\"sidenote-number\" id=\"sn1\" href=\"https://unfathom.ing/archive/2024/the-tragedy-of-discord/\">1</a>Except Facebook sadly. Facebook really needs to go the way of MySpace.</span> when it does, your conversation histories and all of the data in your account will go with it. All those precious memories, gone with no way to recover them.</p>\n<h2 id=\"absolutely-proprietary\" tabindex=\"-1\">Absolutely proprietary <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/the-tragedy-of-discord/\">#</a></h2>\n<p>Despite the claims by the company that “Discord loves open-source” they in fact do not. Nothing about Discord is open source beyond some of the GPL licensed projects that they rely on for their own code. This doesn’t sound like a company that loves open source and wants to contribute back. This sounds like a company that loves open source because it makes their own development cheaper.</p>\n<p>Those that have attempted to reverse engineer and re-implement the Discord technology stack in an open-source way have been hit with legal notices. Just look at what they did to Fosscord and other projects that are re-implementations of their specification.</p>\n<div class=\"callout note\">While proprietary software has its place, when it comes to something as sensitive as personal or work communications, the transparency offered by open-source software is invaluable. It provides a level of scrutiny and trust that closed systems simply cannot match.</div>\n<h2 id=\"server-operators-are-powerless\" tabindex=\"-1\">Server operators are powerless <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/the-tragedy-of-discord/\">#</a></h2>\n<p>As a server operator, you are powerless against the platform. You have no say in what features they decide to add or remove, and what other things they do. There have been instances where Discord have purposely made the platform worse for some users as an April Fools joke<a class=\"sidenote-anchor\" href=\"https://unfathom.ing/archive/2024/the-tragedy-of-discord/\">2</a><span class=\"sidenote\" aria-describedby=\"sn2\"><a class=\"sidenote-number\" id=\"sn2\" href=\"https://unfathom.ing/archive/2024/the-tragedy-of-discord/\">2</a>Like the time they tried to force light mode on users for a day</span>. Is that the kind of platform you want to rely on?</p>\n<h2 id=\"moderators-have-no-say\" tabindex=\"-1\">Moderators have no say <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/the-tragedy-of-discord/\">#</a></h2>\n<p>When the company introduces new features, they are typically Nitro (their 10 dollar monthly subscription) exclusive, or severely limited unless you pay. To access some of these features, your community must be paying for Nitro in order to get “Boosts” which can be used to make your server significantly more useful to everyone. The main problem? This collectively costs 140 dollars per month for the highest tier, and it is on a per-server basis. Every server that wants a decent experience must expect their members to collectively cough up $140 a month.</p>\n<h2 id=\"moderators-have-no-power\" tabindex=\"-1\">Moderators have no power <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/the-tragedy-of-discord/\">#</a></h2>\n<p>Unlike hosting your own community forum or Matrix server, you cannot ban a block of IPs that are used by adversaries to evade bans on Discord. Why? You do not own your server, the company does. The only one with power over your community is Discord themselves. This is a problem for server operators since Discord has very weak alt detection and ban evasion is trivial, as the checks happen client side.</p>\n<p>Discord lulls you into a false sense of ownership and control<a class=\"sidenote-anchor\" href=\"https://unfathom.ing/archive/2024/the-tragedy-of-discord/\">3</a><span class=\"sidenote\" aria-describedby=\"sn3\"><a class=\"sidenote-number\" id=\"sn3\" href=\"https://unfathom.ing/archive/2024/the-tragedy-of-discord/\">3</a>You will own nothing, and you will be happy about it. Classic SaaS model.</span>, when in reality you own nothing beyond the branding of the server and the messages you send. Put bluntly, if Discord decides you don't make them enough money, or you mention alternative platforms, they can delete a community you've built over years and you can do nothing about it.</p>\n<h2 id=\"moderators-have-no-privacy\" tabindex=\"-1\">Moderators have no privacy <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/the-tragedy-of-discord/\">#</a></h2>\n<p>Neither do their communities. For the communities that are intentionally private (meaning they have no public invite links), they also have no privacy. All it takes is one data breach or a misconfiguring of permissions, and your entire chat history including deleted messages is open to the world.</p>\n<h2 id=\"end-users-are-powerless-as-well\" tabindex=\"-1\">End users are powerless as well <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/the-tragedy-of-discord/\">#</a></h2>\n<p>As an end user, you have no power or control over the platform. Just like server operators, you have no say in what features the company chooses to add or remove, and without using a custom client, you have no way to fix the intentionally bad design unless you pay for the Nitro monthly or yearly subscription.</p>\n<h2 id=\"users-have-no-say\" tabindex=\"-1\">Users have no say <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/the-tragedy-of-discord/\">#</a></h2>\n<p>As a user of Discord, you have absolutely zero say in how the platform is run. In fact, the platform is designed to push users towards its Nitro subscription by restricting users who don’t pay, and imposing artificial limitations upon them<a class=\"sidenote-anchor\" href=\"https://unfathom.ing/archive/2024/the-tragedy-of-discord/\">4</a><span class=\"sidenote\" aria-describedby=\"sn4\"><a class=\"sidenote-number\" id=\"sn4\" href=\"https://unfathom.ing/archive/2024/the-tragedy-of-discord/\">4</a>This is known as enshittification. It's what companies do when they get desperate.</span>.</p>\n<p>A good example of this is themes. Users have been using tools like BetterDiscord to customize the look and feel of the platform. Some users do this for accessibility, although most do it because the default experience is just plain awful<a class=\"sidenote-anchor\" href=\"https://unfathom.ing/archive/2024/the-tragedy-of-discord/\">5</a><span class=\"sidenote\" aria-describedby=\"sn5\"><a class=\"sidenote-number\" id=\"sn5\" href=\"https://unfathom.ing/archive/2024/the-tragedy-of-discord/\">5</a>Silly user, you must pay us to have any decent features, and the features you pay for are almost as bad as the free offering!</span>. What does Discord do in this case? They add themes for 10 dollars a month and start banning users who openly talk about their use of client modifications.</p>\n<h2 id=\"users-have-no-power\" tabindex=\"-1\">Users have no power <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/the-tragedy-of-discord/\">#</a></h2>\n<p>You have no power or control over Discord, your data, or your account. You can’t even have the option to sue them unless you let them know and tell them your legal name and other personal information within a month of creating your account, regardless of if you actually plan to sue them, which is not something you should want to give a company that works with the Chinese government.</p>\n<h2 id=\"users-have-no-privacy\" tabindex=\"-1\">Users have no privacy <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/the-tragedy-of-discord/\">#</a></h2>\n<p>You have no control or insight into how Discord uses your data. This should scare you, especially considering their investment and data sharing agreements with Tencent; a company with an awful track record regarding privacy.</p>\n<p>Your DMs on Discord are not end-to-end encrypted<a class=\"sidenote-anchor\" href=\"https://unfathom.ing/archive/2024/the-tragedy-of-discord/\">6</a><span class=\"sidenote\" aria-describedby=\"sn6\"><a class=\"sidenote-number\" id=\"sn6\" href=\"https://unfathom.ing/archive/2024/the-tragedy-of-discord/\">6</a>The company has repeatedly refused to add end-to-end encryption</span> <a class=\"sidenote-anchor\" href=\"https://unfathom.ing/archive/2024/the-tragedy-of-discord/\">7</a><span class=\"sidenote\" aria-describedby=\"sn7\"><a class=\"sidenote-number\" id=\"sn7\" href=\"https://unfathom.ing/archive/2024/the-tragedy-of-discord/\">7</a>This means that the messages you send to your friends are not protected by strong encryption that ensures the company cannot man-in-the-middle to read or modify your messages.</span>, which means employees can read your messages. Their “trust and safety” employees are untrustworthy, and have been known to read the direct messages of their friends, as well as ban users entire accounts as a joke. Privacy and anonymity do not exist on Discord at all.</p>\n<h2 id=\"the-platform-is-a-disaster\" tabindex=\"-1\">The platform is a disaster <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/the-tragedy-of-discord/\">#</a></h2>\n<p>Discord compels users to follow their Terms Of Service by threatening to delete their accounts, but then never does anything about the outsiders who abuse the platform. This leads to a situation where consequences only apply to legitimate users who want to keep their accounts. Bots, spammers, and loggers can do whatever they want<a class=\"sidenote-anchor\" href=\"https://unfathom.ing/archive/2024/the-tragedy-of-discord/\">8</a><span class=\"sidenote\" aria-describedby=\"sn8\"><a class=\"sidenote-number\" id=\"sn8\" href=\"https://unfathom.ing/archive/2024/the-tragedy-of-discord/\">8</a>Tip: To evade Discord bans, use a fresh gmail, and use mobile data to evade the VPN restrictions</span>.\nFunny how that works, isn't it.</p>\n<h2 id=\"what-makes-this-a-tragedy\" tabindex=\"-1\">What makes this a tragedy? <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/the-tragedy-of-discord/\">#</a></h2>\n<p>People have willingly given up the freedoms and privacy that they had on IRC and Matrix to move towards a centralized platform that is hostile towards them, does not care about them, and actively exploits them for monetary benefit.</p>\n<p>Instead of decentralized communities that are truly owned by their leaders / moderators, millions of people moved away from IRC and other decentralized offerings towards the flashy marketing and gamer aesthetic™. People have willingly given up freedoms and privacy for convenience and in the process they’ve also lost what made the early internet communities special; their sovereignty.</p>\n<p>Discord does not care about you, despite the flashy marketing. Discord does not care about people with disabilities, despite their modern UI. Your privacy is an obstacle to their success. If you’re thinking about starting a Discord server, please consider an alternative such as self hosting Element, or if you must have the Discord UI and don't mind a strong liberal bias, Revolt<a class=\"sidenote-anchor\" href=\"https://unfathom.ing/archive/2024/the-tragedy-of-discord/\">9</a><span class=\"sidenote\" aria-describedby=\"sn9\"><a class=\"sidenote-number\" id=\"sn9\" href=\"https://unfathom.ing/archive/2024/the-tragedy-of-discord/\">9</a>Revolt is just as politically biased as Discord. Any mention of the potential of Ukraine losing or there only being two valid genders will get your entire account banned.</span> is an open-source option that might work for you.</p>\n",
			"date_published": "2024-01-05T00:00:00Z"
		}
		,
		{
			"id": "https://unfathom.ing/archive/2024/on-copyright/",
			"url": "https://unfathom.ing/archive/2024/on-copyright/",
			"title": "Copyright",
			"content_html": "<p>The copyright text:</p>\n<div class=\"callout tip\">Copyright © 2024 all text, images, videos, graphs, datasets, files, and other resources unless otherwise noted. I retain full rights over my content and while I do respect fair use, I will go after AI scraper companies and freeloaders.</div>\n<h2 id=\"additional-commentary\" tabindex=\"-1\">Additional commentary <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/on-copyright/\">#</a></h2>\n<p>The one case that I can think of where I might use someone elses content is quoting a person. You'll know if its someone else's words because it will have their name listed below the quote in the callout card. If you don't see some other name listed, assume the quote is mine.</p>\n",
			"date_published": "2024-01-04T00:00:00Z"
		}
		,
		{
			"id": "https://unfathom.ing/archive/2024/chaos-bingo/",
			"url": "https://unfathom.ing/archive/2024/chaos-bingo/",
			"title": "Chaos bingo",
			"content_html": "<p>This is my prediction for 2024's notable events in the tech industry.</p>\n<table>\n<thead>\n<tr>\n<th>C</th>\n<th>H</th>\n<th>A</th>\n<th>O</th>\n<th>S</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Chat Control law passes</td>\n<td>There's at least three boating accidents this year</td>\n<td>AI is used in the court room</td>\n<td>Dread forum gets shut down</td>\n<td>The US drops support for Ukraine</td>\n</tr>\n<tr>\n<td>My platform gets subpoenaed or shut down</td>\n<td>AI is captured by a government agency</td>\n<td>Telegram hits a billion users</td>\n<td>Discord has a massive scandal</td>\n<td>Apple does AI integration (beyond Siri)</td>\n</tr>\n<tr>\n<td>The feds crack Monero</td>\n<td>Minecraft gets AI integration</td>\n<td>TikTok gets banned in the US</td>\n<td>Telegram caught selling user data</td>\n<td>Snapchat copies Twitter's short posts</td>\n</tr>\n<tr>\n<td>Android gets mandatory AI integration</td>\n<td>China takes over Taiwan or Hong Kong</td>\n<td>Facebook stock hits $500</td>\n<td>Status finally releases a mobile app</td>\n<td>A federal agency pays me a visit</td>\n</tr>\n<tr>\n<td>Elon smokes another blunt</td>\n<td>Facebook the social app loses markrt share globally</td>\n<td>Element the company goes bankrupt</td>\n<td>Microsoft markets a PC with AI software preinstalled</td>\n<td>DuckDuckGo does an AI integration</td>\n</tr>\n</tbody>\n</table>\n",
			"date_published": "2024-01-03T00:00:00Z"
		}
		,
		{
			"id": "https://unfathom.ing/archive/2024/about-me/",
			"url": "https://unfathom.ing/archive/2024/about-me/",
			"title": "About Me",
			"content_html": "<p>I'm Du, an aspiring generalist in the world of computer science. My journey began with being introduced to Linux when I was eight years old, and since then, I've been on a mission to understand as much of the tech landscape as possible. This curiosity has led me to explore a wide variety of technologies, from <a href=\"https://unfathom.ing/archive/2024/my-programming-journey/\">mobile app development</a> to building a <a href=\"https://unfathom.ing/archive/2024/building-a-search-engine\">privacy focused search engine from scratch</a>.</p>\n<p>One of my guiding principles has been to gain hands-on experience with as many technologies as possible. I've worked with nearly every consumer-accessible tech within a $1,000 budget, as I believe strongly that practical experience is the best teacher. This approach has given me a unique perspective on the strengths and limitations of various tools and platforms.</p>\n<h2 id=\"skills-and-expertise\" tabindex=\"-1\">Skills and expertise <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/about-me/\">#</a></h2>\n<p>I specialize in covert communications with extensive experience in computer networking, both hardware and software. I have:</p>\n<ul>\n<li>Developed and shipped three full-stack mobile apps on Google Play, amassing 1.2 million downloads.</li>\n<li>Managed a network infrastructure supporting 20 million third-party client connections.</li>\n<li>Expertise in virtualization (VMware, Proxmox), real-time communication (Matrix), and custom cloud infrastructure development.</li>\n</ul>\n<h2 id=\"languages\" tabindex=\"-1\">Languages <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/about-me/\">#</a></h2>\n<p>I'm fluent in American English and know some domain-specific Mandarin.\nAs for programming languages, I am reasonably proficient in:</p>\n<ul>\n<li><strong>Rust</strong>: Developed a search engine in pure Rust, including spider, indexer, and dynamic HTML generator (without any JavaScript).</li>\n<li><strong>Dart</strong>: Built two cross-platform mobile apps using Flutter, including a privacy-focused messaging app and a superapp.</li>\n<li><strong>JavaScript</strong>: Created this website.</li>\n<li><strong>Kotlin</strong>: Developed three native Android apps, including two seperate clients for a Minecraft content viewer and a peer-to-peer chat app.</li>\n<li><strong>Crystal</strong>: Reimplemented all of my finance calculators and two backend services related, which resulted in a 3x speed increase.</li>\n</ul>\n<h2 id=\"current-occupation\" tabindex=\"-1\">Current occupation <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/about-me/\">#</a></h2>\n<p>Seeking full-time employment</p>\n<h2 id=\"personal-values\" tabindex=\"-1\">Personal values <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/about-me/\">#</a></h2>\n<p>I value privacy and self-sovereignty above all. I believe that you should have the right to do as you wish, but also that you should accept the consequences (good or bad) for whatever you do, so you should consider those consequences before doing as you wish.</p>\n<h2 id=\"political-lean\" tabindex=\"-1\">Political lean <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/about-me/\">#</a></h2>\n<p>As a libertarian, I prioritize individual liberty and the free flow of information. My views are rooted in principles rather than partisan politics or fringe ideologies. I'm an advocate for fundamental freedoms, including those of speech, press, and assembly. I value objectivity and truth, even when it challenges prevailing narratives or social norms.</p>\n<h2 id=\"awards-or-achievements\" tabindex=\"-1\">Awards or achievements <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/about-me/\">#</a></h2>\n<p>My work has appeared in a local newspaper<a class=\"sidenote-anchor\" href=\"https://unfathom.ing/archive/2024/about-me/\">1</a><span class=\"sidenote\" aria-describedby=\"sn1\"><a class=\"sidenote-number\" id=\"sn1\" href=\"https://unfathom.ing/archive/2024/about-me/\">1</a>I wasn't too thrilled with their finished article, It didn't capture the ideas and reasons for doing what I do that were discussed in the interview.</span> and I've successfully completed a few privately ran bug bounties.</p>\n<h2 id=\"favorite-books-movies-or-music\" tabindex=\"-1\">Favorite books, movies, or music <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/about-me/\">#</a></h2>\n<p>I like reading blogs and websites mostly, so here's a list of my favorites: <a href=\"https://trilema.com\">Trilema</a>, <a href=\"https://gwern.net\">Gwern.net</a>, <a href=\"https://lesswrong.com\">LessWrong</a></p>\n<h2 id=\"pets\" tabindex=\"-1\">Pets <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/about-me/\">#</a></h2>\n<p>I have a cat named Scout. I found him outside in the freezing cold when I went to let my dog out. The dog ran over and sniffed a pile of snow which I thought was odd, so I ran over in the snow (barefoot of course) and found a scrawny kitten, only a week or two old, freezing to death. I brought him back to life and he's been my companion for a few years now.</p>\n<h2 id=\"social-media-usage\" tabindex=\"-1\">Social media usage <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/about-me/\">#</a></h2>\n<p>I don't use social media. None at all<a class=\"sidenote-anchor\" href=\"https://unfathom.ing/archive/2024/about-me/\">2</a><span class=\"sidenote\" aria-describedby=\"sn2\"><a class=\"sidenote-number\" id=\"sn2\" href=\"https://unfathom.ing/archive/2024/about-me/\">2</a>I really <a href=\"https://unfathom.ing/archive/2024/the-tragedy-of-discord\">hate Discord</a> with a passion</span> due to the destruction of society's collective mental wellbeing that's resulted from its use. I am <a href=\"https://unfathom.ing/archive/2024/against-social-media\">against social media</a> and if you find people claiming to be me on Reddit or whatever, they are liars.</p>\n<h2 id=\"fun-facts-or-quirks\" tabindex=\"-1\">Fun facts or quirks <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/about-me/\">#</a></h2>\n<p>I struggle with insomnia, often finding myself caught in that <a href=\"https://unfathom.ing/archive/2024/liminal-spaces\">liminal space</a> between alertness and exhaustion. During these nocturnal hours, I often write code, chat with people on Dread, and occasionally dictate thoughts into <a href=\"https://obsidian.md\">Obsidian</a> which form the basis of these blog posts.</p>\n<h2 id=\"cultural-background\" tabindex=\"-1\">Cultural background <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/about-me/\">#</a></h2>\n",
			"date_published": "2024-01-02T00:00:00Z"
		}
		,
		{
			"id": "https://unfathom.ing/archive/2024/hello-world/",
			"url": "https://unfathom.ing/archive/2024/hello-world/",
			"title": "Hello World!",
			"content_html": "<p>Welcome to Unfathoming, a blog born from a New Year's resolution to improve my English writing skills. Inspired by the fascinating niche blogs I've encountered, I decided to carve out my own corner of the internet.</p>\n<p>Here, I'll explore and share my thoughts, research, and experiences on a variety of topics, primarily centered around privacy, security, and other areas of computer science that interest me. My interests also extend to the darker corners of the internet, including the dark web and its implications for online anonymity, free markets, and censorship resistance.</p>\n<h2 id=\"why-write\" tabindex=\"-1\">Why write? <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/hello-world/\">#</a></h2>\n<p>As I see it, content creation (especially writing) is <a href=\"https://unfathom.ing/archive/2024/the-antithesis-of-content-consumption\">the antithesis of content consumption</a>, as it takes a conscious effort to compile your thoughts, feelings, and ideas in a way that makes sense to outsiders.</p>\n<p>I've always wanted to improve my English skills, and maintaining a blog is a way to achieve that in a relatively low-stakes environment, away from the noise, trendiness, and engagement-seeking of the rest of the internet. This is also why my blog lacks a comment section or any way to contact me<a class=\"sidenote-anchor\" href=\"https://unfathom.ing/archive/2024/hello-world/\">1</a><span class=\"sidenote\" aria-describedby=\"sn1\"><a class=\"sidenote-number\" id=\"sn1\" href=\"https://unfathom.ing/archive/2024/hello-world/\">1</a>I actively avoid social media and I don't have any accounts. If you see someone claiming to be me, they are lying.</span>.</p>\n<p>The IT industry is evolving, and much of the resulting output cannot be considered finished. There's always new updates to be shipped and new releases to follow. I was drawn towards writing for the exact opposite reason; when you're done writing and you hit the &quot;Commit &amp; Push&quot; button, you can move on to the next topic.</p>\n<h2 id=\"why-the-name-unfathoming\" tabindex=\"-1\">Why the name &quot;Unfathoming&quot;? <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/hello-world/\">#</a></h2>\n<div class=\"callout note\">Definition of Unfathoming:<br>Unfathoming: Synonym of Unfathomable. Present tense. To find hard to believe, not in a way rooted in skepticism, but because it is a difficult reality to process.</div>\n<p>I chose the name &quot;Unfathoming&quot; because it encapsulates both my personal life and the essence of the topics I plan to discuss on this blog. On the surface, my life might seem like that of an ordinary computer nerd, but beneath that exists a world of complexity that I even struggle to comprehend at times.</p>\n<p>The name &quot;Unfathoming&quot; also hints at the depth of analysis I aim to provide. While many sources barely scratch the surface of complex topics such as the dark web while offering a sanitized or sensationalized narrative for clicks and views, I intend to dive deep into these subjects and offer honest, unfiltered opinions and thoughts as I go<a class=\"sidenote-anchor\" href=\"https://unfathom.ing/archive/2024/hello-world/\">2</a><span class=\"sidenote\" aria-describedby=\"sn2\"><a class=\"sidenote-number\" id=\"sn2\" href=\"https://unfathom.ing/archive/2024/hello-world/\">2</a>Primarily through the use of sidenotes like this one.</span>. My goal is to provide insights based on my decade of hands-on experience in computer science, challenging the mainstream and discussing topics that the media deliberately avoids.</p>\n<h2 id=\"why-a-website\" tabindex=\"-1\">Why a website? <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/hello-world/\">#</a></h2>\n<p>My decision to build a minimalist website comes from years of observing the volatile landscape<a class=\"sidenote-anchor\" href=\"https://unfathom.ing/archive/2024/hello-world/\">3</a><span class=\"sidenote\" aria-describedby=\"sn3\"><a class=\"sidenote-number\" id=\"sn3\" href=\"https://unfathom.ing/archive/2024/hello-world/\">3</a>Both politically with censoring speech, as well as technologically with closures.</span> of social media. While I've watched platforms rapidly rise to prominence only to fade into obscurity, personal websites seem to maintain a core audience that is there for the content, not just because an algorithm has addicted them. I believe that keeping this in mind, Unfathoming can outlive the popular social platforms<a class=\"sidenote-anchor\" href=\"https://unfathom.ing/archive/2024/hello-world/\">4</a><span class=\"sidenote\" aria-describedby=\"sn4\"><a class=\"sidenote-number\" id=\"sn4\" href=\"https://unfathom.ing/archive/2024/hello-world/\">4</a>Helped by the fact that it is built using Markdown and other standards.</span>. This self-hosted approach grants me independence from corporate whims and changing terms of service, ensuring that my ideas and research can theoretically last for centuries.</p>\n<p>I'm a strong believer in self-sovereignty, which also extends to the sovereignty of the platform I choose to share my ideas on. Instead of screaming into the void of Facebook, Instagram, or Twitter<a class=\"sidenote-anchor\" href=\"https://unfathom.ing/archive/2024/hello-world/\">5</a><span class=\"sidenote\" aria-describedby=\"sn5\"><a class=\"sidenote-number\" id=\"sn5\" href=\"https://unfathom.ing/archive/2024/hello-world/\">5</a>Supposedly its X now, but I won't call it that.</span>, I wish to create my own space where I don't have to fight an algorithm for your attention.</p>\n<p>If the design philosophy behind this website interests you more, you may be interested in the article on <a href=\"https://unfathom.ing/archive/2024/the-new-site-design/\">the new site design</a>.</p>\n<h2 id=\"keeping-in-contact-and-support\" tabindex=\"-1\">Keeping in contact and support <a class=\"header-anchor\" href=\"https://unfathom.ing/archive/2024/hello-world/\">#</a></h2>\n<p>If you enjoy the content I offer, you can stay updated through my <a href=\"https://unfathom.ing/feed/feed.xml\">RSS feed</a>. Feel free to add it to your preferred feed reader. Keep in mind that my writing is often iterative, meaning posts may be updated or expanded over time. If you find value in my work and wish to support it, you can <a href=\"https://unfathom.ing/donate\">donate Monero</a>. However, please note that donations are entirely optional and won't affect the quality or frequency of my content.</p>\n",
			"date_published": "2024-01-01T00:00:00Z"
		}
		
	]
}
